[
    {
        "id": "traffic-rider",
        "title": "Traffic Rider",
        "description": "Traffic Rider is a first-person endless racing game that puts you on a motorbike for an exhilarating ride. With a full career mode, lifelike bike sounds, and detailed graphics, it redefines arcade racing. Speed through highways, overtake traffic, and upgrade your rides to conquer challenging missions. Embrace the thrill and master the art of smooth racing.\r\n\r\nFeatures\r\nFirst person camera view\r\n34 motorbikes to choose from\r\nReal motor sounds recorded from real bikes\r\nDetailed environments with day and night variations\r\nCareer mode with 90+ missions\r\nOnline leaderboards and 30+ achievements\r\nSupport for 19 languages\r\nLast Updated\r\nMar 27, 2025\r\n\r\nControls\r\nUp arrow = throttle\r\nDown arrow = brake\r\nLeft arrow = left\r\nRight arrow = right\r\nHorn = H\r\nWheelie = Y\r\nLook left = T\r\nLook right = U\r\nGear up = R\r\nGear down = F\r\nPause = P or F1\r\nYou can always change controls in settings menu.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/traffic-rider-vvq\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743257697685.jpg"
    },
    {
        "id": "sky-riders",
        "title": "Sky Riders",
        "description": "Sky Riders is a high-speed casual vehicle driving game. Put your driving skills to the test as you complete several challenging tracks. Stay focused and avoid falling off! Whether you're behind the wheel of a car or riding a motorcycle, prepare for an adrenaline-fueled adventure and unforgettable racing moments. Get ready to conquer difficult tests and feel the excitement of Sky Riders!\r\n\r\nThis game is similar to other casual car games, but has a more realistic twist. For something more arcade-style, check out Super Hero Driving School and Ramp Car Jumping!\r\n\r\nFeatures\r\nDrive bikes and cars through the sky\r\n30 challenging tracks to complete\r\nRealistic physics make the game tricky\r\nSee what awesome stunts you can do!\r\nRelease Date\r\nJune 2023\r\n\r\nDeveloper\r\nSky Riders was developed by Stand By Games.\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nLast Updated\r\nDec 21, 2023\r\n\r\nControls\r\nW or up arrow key = forward\r\nS or down arrow key = back\r\nA or left arrow key = move left\r\nD or right arrow key = move right\r\nSpace = handbrake\r\nLeft mouse button = interact ingame UI",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/sky-riders-buk\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743260555299.jpg"
    },
    {
        "id": "mahjongg-solitaire",
        "title": "Mahjongg Solitaire",
        "description": "Mahjongg Solitaire is an online mahjong puzzle board game featuring traditional rules and modern visuals. There are no shuffles, and the game is timed, but the game's pace is relaxed.\r\n\r\nHow to Play Mahjongg Solitaire\r\nSpot the patterns\r\n\r\nMahjong is a tricky puzzle game. There are so many tiles, many of which look the same but feature slight differences. Along with the need to spot these patterns, you can’t move any pieces with both sides blocked. The left or right side needs to be accessible, at least.\r\n\r\nUse hints when you’re stuck\r\n\r\nMahjongg Solitaire features hints if you get stuck, but unlike some other mahjong games, it does not have a shuffle feature. The games are also timed, meaning there is some urgency to how many tiles you can match.\r\n\r\nWhen the game ends, you’ll get a score for the tiles you matched and a bonus for how far you got in the game before your time ran out.\r\n\r\nTile groups in Mahjongg Solitaire\r\nMahjongg Solitaire features 144 tiles divided primarily into three suits. The primary suits are:\r\n\r\nDots - feature circles\r\nBamboo - feature lines\r\nCharacters - feature Chinese characters\r\nIn Mahjongg Solitaire, you’ll also notice special tiles that can be matched even without the same image. These are highlighted in blue or green.\r\n\r\nMore Games Like This\r\nMahjong Solitaire is an excellent choice for a beginner or regular Mahjong enthusiast. However, there are many other titles in our collection of Mahjong games such as Mahjong. Other puzzle games you may like include board games such as Yahtzee Online, Rummikub, and Ludo.\r\n\r\nRelease Date\r\nOctober 2016\r\n\r\nPlatform\r\nWeb browser (desktop and mobile). We also have the Android version.\r\n\r\nLast Updated\r\nAug 03, 2022\r\n\r\nControls\r\nUse the left mouse button to interact.\r\n\r\nFAQ\r\nIs it spelled mahjong or mahjongg?\r\nBoth words are correct and are used to describe the same game.\r\nIs Mahjongg Solitaire a difficult game?\r\nMahjong is generally a tricky game, but this is probably a medium-difficulty mahjong game compared with others. There are no shuffles, but you have 10 minutes and unlimited hints which balances the game nicely.\r\nIs Mahjong Solitaire a free game?\r\nYes, you can play Mahjong Solitaire online for free at CrazyGames.\r\n\r\nIs Mahjong good for the brain?\r\nPuzzle games are often cited as keeping the mind sharp and maintaining brain health.",
        "category": "puzzle",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mahjongg-solitaire\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743264862795.jpg"
    },
    {
        "id": "farm-merge-valley",
        "title": "Farm Merge Valley",
        "description": "Farm Merge Valley is a puzzle business farming game where you merge various animals and objects to upgrade them. Grow crops and add animals to your farm while expanding to exciting new lands. Discover the peaceful farm life you always dreamed of while reaping the rewards from various challenges.\r\n\r\nHow to Play Farm Merge Valley\r\nMerge to grow your farm\r\n\r\nBuild the perfect farm life for your friendly neighbors and animals. Start by merging crops to reach new types of things to grow. You can create various animals, crops, and materials to produce goods and repair buildings.\r\n\r\nLevel up your experience\r\n\r\nKeep merging to gain experience points and increase your level. You will unlock new items and rewards that help you progress in the game when you level up. Leveling up brings more game features to enjoy and areas that help expand your farm.\r\n\r\nFulfil orders to earn money\r\n\r\nWhen your animals produce output, you can use the product to manufacture goods to sell for money. You can use your currency to purchase new areas of land and grow your farm to new heights. You'll find new buildings to renovate and expand your production to new heights that deliver greater monetary rewards.\r\n\r\nMore Games Like This\r\nYou might want to play something new when you've finished Farm Merge Valley. Browse our merge games for more free and fun gaming experiences. Little Alchemy and Little Alchemy 2 are worth a try. Other puzzle games you may enjoy are Bolts and Nuts and Sand Tetris. You may also want to have a look at our wide range of farming games.\r\n\r\nFeatures\r\nMerge crops and animals to create more valuable items\r\nComplete various tasks and reap the rewards from your labor\r\nExpand to new lands as you progress\r\nBuild a beautiful self-sustaining farm life\r\nRelease Date\r\nNovember 2022\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nMar 17, 2025\r\n\r\nControls\r\nPress and hold the left mouse button to pick up and move objects on the grid.\r\n\r\nFAQ\r\nHow can I make money more quickly in Farm Merge Valley?\r\nThe best way is to save your coins so you can merge them. Try to reach the golden star coin to get a big payout.\r\n\r\nWhat are the toolboxes for in Farm Merge Valley?\r\nThey provide one component required to renovate a new area of production.\r\n\r\nHow do you play Farm Merge?\r\nFarm Merge tasks you with creating the perfect farm life for your friendly neighbors and animals. Merge crops to create a bustling farm of animals, materials and plenty of food!",
        "category": "puzzle",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/farm-merge-valley\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743429906309.jpg"
    },
    {
        "id": "words-of-wonders",
        "title": "Words of Wonders",
        "description": "Words of Wonders is a crossword puzzle where you connect letters to reveal hidden words. Test your vocabulary and find all the words to progress and reach more challenging levels. Will you become a master wordsmith in this delightful word game?\r\n\r\nHow to Play Words of Wonders\r\nWords of Wonders is an engaging word puzzle game that combines the excitement of crossword puzzles with the thrill of word search. Players form words by connecting letters in a grid, unlocking hidden words,, and progressing through levels.\r\n\r\nYou'll see a grid of random letters when you start the game. Each grid represents a level; your task is to find words by connecting adjacent letters. You can swipe your finger over the letters in any direction—horizontally, vertically, or diagonally—to form words. Longer words and more complex combinations may unlock bonus rewards, so watch for opportunities to maximize your word choices.\r\n\r\nConnect the letters to form a word. It will be revealed if the word you formed is on the crossword grid. Not all words will be on the grid, so use the letters you have already discovered to ensure you create words that will fit the puzzle!\r\n\r\nCompleting the grid allows you to unlock the next level, which gets progressively more challenging. The difficulty increases with more letters and words to find, so keep your brain engaged as you move through the game.\r\n\r\nSome examples include finding the words “WON,” “OWN,” “NOW,” or “TOP,” “POT,” or “OPT” from a set of three letters. Or a mixture of three and four-letter words to form “WALL,” \"ALL,” and “LAW.”\r\n\r\nIf you find yourself stuck, there are hints and boosters available to help you out. These tools can reveal letters or help you find the next word, though they're limited, so use them wisely. There are also rewards for completing levels or discovering difficult words, such as coins or additional hints, which can help you advance further.\r\n\r\nProgress through the levels and collect unique background images with each new milestone. The levels get more difficult by introducing longer words and more letters, increasing the chances of getting it wrong and challenging your vocabulary skills!\r\n\r\nSome levels feature specific themes, like landmarks or animals, where the words you form are related to that theme. As you progress, you’ll unlock different \"worlds\" or locations, each with unique challenges and puzzles. You also get fun bits of info throughout, like learning that The Great Pyramid of Giza is the oldest of the Seven Wonders of the Ancient World.\r\n\r\nThe goal is to find all the words in the grid before you run out of moves or time. Each level has a set number of words to complete in order to progress to the next stage. You may also encounter bonus rounds or challenges that offer extra rewards when completed.\r\n\r\nAs you move through levels, you'll earn points, coins, and other rewards, which will help you advance in the game. Some versions of the game also let you compete against friends or other players, adding a competitive element to the experience.\r\n\r\nWith its relaxing pace and engaging gameplay, Words of Wonders is a fun way to challenge your mind and expand your vocabulary while enjoying an immersive puzzle-solving experience.\r\n\r\nEnjoy a range of exciting and challenging word puzzles in Words of Wonders. The game features an easy starting point to suit players of all ages and experience levels. See how good you are at finding all the words and become a master wordsmith!\r\n\r\nGame Tips\r\n\r\nUse the letters you have already discovered as a clue to find the word\r\nUse the hammer icon to reveal a letter of your choice\r\nClick on the hints button to reveal a random letter\r\nEarn gems to buy hints and reveal letters\r\nMore Games Like This\r\nOnce you’ve reached your linguistic limits in Words of Wonders, check out more of our curated word games. There are many fun word games for all knowledge levels. Two popular choices to play next are Word Wipe, a word search game with a twist where you use letters from all around and in any direction; Word Scramble, a classic word game where you unscramble letters to find words, or Word Search, a simple yet classic game offered in different languages.\r\n\r\nRelease Date\r\nApril 2018 (Android and iOS)\r\nMay 2023 (HTML5)\r\nDeveloper\r\nWords of Wonders was made by Famobi.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 19, 2023\r\n\r\nControls\r\nDrag the left mouse button on the letters to assemble a word.\r\n\r\nFAQ\r\nHow do you earn sapphires in Words of Wonders?\r\nYou can earn gems by completing levels and taking part in the daily spin to win.\r\n\r\nIs Words of Wonders a difficult game?\r\nIt's not too tricky to play, but gets harder as the levels progress. It's an excellent game for all ages.",
        "category": "puzzle",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/words-of-wonders\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743266067856.jpg"
    },
    {
        "id": "smash-karts",
        "title": "Smash Karts",
        "description": "Smash Karts is a 3D multiplayer IO kart battle game. Drive your go-kart, pick up weapons, and blow up other karts to win! Keep playing to level up and unlock new characters and prizes.\r\n\r\nHow to Play Smash Karts\r\nBattle and earn XP\r\nFace off with other players in the arena for 3 or more minutes of kart-smashing mayhem. The game has several maps to explore, and it is actively updated with more. Each public game you play will give you XP, which you can then use to level up. \r\n\r\nLeveling up will reward you with coins, hats, wheels, and character tokens. You can use character tokens in the prize machine to unlock new characters with varying rarity levels.\r\n\r\nPick up weapons\r\nDrive over the boxes containing question marks to pick up random weapons and power-ups. You’ll find anything from invincibility to missiles, machine guns, and mines to use against your opponents. Get in your kart and cause some chaos!\r\n\r\nCustomize your kart!\r\nChoose between a selection of wacky little characters and karts. You can customize your kart and characters in the customize menu. There, you’ll find a selection of karts, characters, hats, and holiday items! Use your coins, character tokens, and gems to buy various in-game items.\r\n\r\nPlay in events\r\nVarious seasonal events occur throughout the year, so make sure to come back and play Smash Karts at special times of year for new content. New maps are available around Halloween, Christmas, and other festive occasions, and you can reap unique rewards.\r\n\r\nMore Games Like This\r\nKart games like SmashKarts.io combine two awesome game modes together: deathmatch arena and kart driving. Kart Wars is an intensely chaotic multiplayer kart game inspired by Mario Kart. Choose from a range of characters and conquer the arena. More kart games can be found here. Other popular online IO games include 1v1.lol, Agaro.io, and Ducklings!\r\n\r\nFeatures\r\nAction-packed multiplayer kart battles\r\nLevel up, earn coins, and save your stats\r\nSeveral weapons, from miniguns to bombs!\r\nCustomizable karts and characters\r\nRelease Date\r\nMarch 2020\r\n\r\nUpdates\r\nJune 2020: A new level, The Gravel Pit\r\nDeveloper\r\nSmashKarts.io is developed by Tall Team. They also developed the game Investor Island and BlastAR Pro, an augmented reality arcade game.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\niOS\r\nAndroid\r\nLast Updated\r\nMar 21, 2025\r\n\r\nControls\r\nWASD or arrow keys to drive\r\nSpace to fire weapons\r\nFAQ\r\nWho made Smash Karts?\r\nSmash Karts was made by Tall Team.\r\nHow do you get coins in Smash Karts?\r\nWhen you level up you will earn coins and other in-game items.\r\nHow to shoot in Smash Karts?\r\nUse the space bar to shoot in Smash Karts.\r\n\r\nIs Smash Kart addictive?\r\nWith over 1 million downloads on IOS and the App Store, Smash Karts has plenty of addictive gameplay qualities, gathering even more players. This game requires a mixture of strategy and skill, which makes for the perfect competitive experience.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/smash-karts\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315018354.jpg"
    },
    {
        "id": "sandbox-city",
        "title": "Sandbox City",
        "description": "Sandbox City - Cars, Zombies, Ragdolls! is a zombie game where you can explore freely and drive around the city, but, be careful of the zombie's infection! Find the zombies and kill them before the infection spreads around and the city.\r\n\r\nRelease Date\r\nNovember 2020 (Android)\r\nJuly 2021 (iOS)\r\nDecember 2021 (WebGL)\r\nDeveloper\r\nYilmaz Kiymaz made Sandbox City - Cars, Zombies, Ragdolls!.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\niOS\r\nLast Updated\r\nMar 27, 2025\r\n\r\nControls\r\nWASD or arrow keys = move\r\nLeft-click = attack. Hold to shoot\r\nHold shift = run\r\nSpace = jump when on foot, handbrake when in the car\r\nE = enter \/ exit car, buy items\r\nR = switch between weapons\r\nT = enter and exit Slo-Mo mode\r\nL = lock \/ unlock mouse cursor\r\nC = change camera perspective\r\nEsc = quit",
        "category": "action",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/sandbox-city---cars-zombies-ragdolls\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317823377.jpg"
    },
    {
        "id": "polytrack",
        "title": "PolyTrack",
        "description": "PolyTrack is a fast-paced, low-poly driving game featuring thrilling loops, jumps, and high-speed action where every millisecond counts. Inspired by TrackMania, it challenges you to race against the clock, constantly striving to improve your time on various tracks built by you and the Polytrack community! It doesn't get any more hands-on than that.\r\n\r\nHow to Play Polytrack\r\nPolytrack is a classic car racing game with a slight twist. You race a car you customize and on a track you've designed yourself. This means you not only have to think about beating your own record when it comes to time, but you also need to master the craft of building for speed and precision.\r\n\r\nStart by creating your track using the game’s design tools or choosing from pre-made tracks. Customize the track with various obstacles, ramps, and curves to suit your preferences. Don't know exactly what track to build? Get help from the Polytrack community. There are plenty of forums that share design codes and customizing tips.\r\n\r\nWith a built-in level editor, you can unleash your creativity by designing custom tracks. You can also export and share these tracks with others for endless racing (and design) fun.\r\n\r\nThe game will require time and patience, as you don't just go into it like other driving games, with your foot on the pedal and ready to rev and drift. Initially, the easiest tracks to build are straight lines, but as soon as you get the hang of it, you will have a track jumping over mountains, sending your car and score soaring.\r\n\r\nA series of premade tracks is available for those who want to begin practicing and getting a feel for other designs.\r\n\r\nMore Games Like This\r\nOnce you've mastered building your tracks, you can enjoy these other thrilling driving games: Moto X3M, where you experience high-octane motocross action with challenging courses, stunts, and exciting levels, or Drift Hunters where you test your drifting skills in this game that features a variety of cars and tracks designed for perfecting those thrilling drifts.\r\n\r\nRelease Date\r\nMarch 2023\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nNov 04, 2024\r\n\r\nControls\r\nDriving Controls\r\nWASD \/ arrow keys = drive\r\nEnter \/ R = restart\r\nEditor Controls\r\nLeft-click = build\r\nRight-click + move = move camera view\r\nMiddle mouse-click + move = rotate camera view\r\nMouse-scroll = zoom in \/ out\r\nShift + mouse-scroll \/ ZC = height up \/ down\r\nQE = rotate camera view to the left \/ right\r\nR \/ Space = rotate item\r\nX = delete item\r\nT = test drive\r\nFAQ\r\nHow to play Polytrack?\r\nIn Polytrack, you race a car you customize on a track you've designed yourself. This means you have to think about beating your record and master the craft of building for speed and precision.\r\n\r\nCan I share my track designs with other Polytrack players?\r\nPolytrack has an active and robust online community where you can share design codes and customizing tips.",
        "category": "racing",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/polytrack\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315719059.jpg"
    },
    {
        "id": "parking-jam",
        "title": "Parking Jam",
        "description": "Parking Jam is a challenging puzzle game where you untangle a crowded parking lot one car at a time. Use your logic and problem-solving skills to move vehicles in the correct order, clearing the way without causing chaos. With each level, tackle increasingly complex puzzles filled with more cars and tricky obstacles.\r\n\r\nHow to Play Parking Jam\r\nEveryone's been stuck in a parking jam, but the real challenge is figuring out how to escape!\r\n\r\nThis is a satisfying puzzle game where you click and drag cars to clear them from a crowded parking lot and onto the street. As you progress through the rounds, the difficulty increases, with road barriers and tighter spaces making it harder to maneuver the vehicles. Careful planning is key to getting all the cars out.\r\n\r\nCars can be moved in reverse, allowing for different strategies to clear the jam. Each puzzle comes with a limited number of moves, so you’ll need to think ahead and use them wisely. Your score also reflects how many players have successfully solved the same parking jam, giving you a sense of the challenge level.\r\n\r\nSome levels, like Level 11, are especially tricky due to the sheer number of cars blocking the way. Can you navigate through the toughest jams and free up the lot?\r\n\r\nMore Games Like This\r\nBuckle up and keep your eyes on the road. You can continue on your journey with some of our most popular driving games like Drift Hunters, a 3D game that lets you experience the art of drifting with an impressive range of tuned-up cars and dynamic tracks; Mr Racer, where you can zoom through busy streets in various locations; or Moto X3M, a driving bike game that takes dirt bike racing to the next level.\r\n\r\nControls\r\nClick and slightly drag the cars in the direction you want them to get out of the parking lot.\r\n\r\nFAQ\r\nHow do you play the car jam game?\r\nParking Jam is a puzzle game where you click and drag cars to clear them from a crowded parking lot, getting the cars out of gridlock and onto the streets.\r\n\r\nIs Parking Jam a real game?\r\nParking Jam is indeed a real game and can be played online for free at CrazyGames.",
        "category": "racing",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/parking-jam-dqq\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315804291.jpg"
    },
    {
        "id": "night-city-racing",
        "title": "Night City Racing",
        "description": "Night City Racing is a car-driving game with fantastic races, epic stunts, and awesome supercars. Gear up for heart-pounding races and wild challenges that will test your skills! Rack up cash as you speed through the tracks and use it to upgrade to flashy, jaw-dropping cars. Whether you’re showing off your racing skills in epic two-player mode or going for solo glory, the trophy is yours for the taking. So buckle up, race hard, and let everyone know you’re the ultimate speed demon!\r\n\r\nHow to Play Night City Racing\r\nRace against the competition\r\n\r\nGet in the driver’s seat and tackle some of the world’s best sports cars head-on. As you progress, there are 16 racing challenges to complete that increase in difficulty. Take on anything from the tricky corners of city streets to the open landscapes of an airfield in these thrilling races.\r\n\r\nComplete various challenges\r\n\r\nEarn some extra cash by completing five fun challenges. You’ll race against an airplane and the clock to the finish line on a range of obstacle-laced tracks. If you’re successful, the money flows into your account.\r\n\r\nGo for a spin in the free drive\r\n\r\nGo stunt crazy in the open-world free-drive game mode. Rack up some cash doing epic stunts and speed around without limits in an open arena filled with ramps and other stunt-worthy objects.\r\n\r\nBuy and upgrade your supercar\r\n\r\nUse all that gold coinage you’ve earned as a reckless steering-wheel protagonist to expand your supercar collection. Tune up the engine and brakes, wear flashy new wheels, and treat yourself to a two-toned paint job. Night City Racing puts you in the driver’s seat.\r\n\r\nMore Games Like This\r\nCrazyGames has a vast selection of racing games and driving games, so once you’ve finished Night City Racing, check them out! A few popular right now include Moto X3M, a challenging motorcycle game featuring timed obstacle courses and stunts, and Drift Hunters, a car drifting game emphasizing realistic physics and customizable vehicles for high-speed drifting action.\r\n\r\nRelease Date\r\nJanuary 2023 (Android and WebGL)\r\n\r\nDeveloper\r\nNight City Racing was developed by RHM Interactive.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\nLast Updated\r\nNov 13, 2024\r\n\r\nControls\r\nIf playing one-player\r\n\r\nWASD \/ arrow keys = move\r\nR-Shift \/ L-Shift = NOS\r\nR = restart car position\r\nT = look back\r\nC = change camera view\r\nIf playing two-player\r\n\r\nPlayer 1\r\nArrow keys = move\r\nM = NOS\r\nO = restart car position\r\nL = look back\r\nK = change camera view\r\nPlayer 2\r\nWASD = move\r\nL-Shift = NOS\r\nR = restart car position\r\nT = look back\r\nC = change camera view\r\nFAQ\r\nHow many cars are there in Night City Racing?\r\nThere are 10 cars to drive. You already own two - the other 8 you can buy with in-game money.\r\n\r\nIs it worth completing the challenges in Night City Racing?\r\nYes, the challenges aren't too tricky and you earn good money for finishing them successfully.\r\n\r\nIs there a free racing game?\r\nThere are plenty of racing games to play online in your browser. Some popular games include Night City Racing.",
        "category": "racing",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/night-city-racing\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315953990.jpg"
    },
    {
        "id": "demolition-derby-3",
        "title": "Demolition Derby 3",
        "description": "Demolition Derby 3 is a thrilling car game offering open-world driving and multiplayer modes. Choose from 100 vehicles, upgrade performance, and customize your ride. Enjoy 20+ tracks and demolition arenas, daily rewards, and first-person driving!\r\n\r\nRelease Date\r\nDecember 2018 (Android)\r\nFebruary 2019 (iOS)\r\nJuly 2024 (WebGL)\r\nPlatforms\r\nWeb browser\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 09, 2024\r\n\r\nControls\r\nWASD or arrow keys = drive\r\nShift = boost\r\nC = change camera\r\nQ\/E = rotate camera\r\nV = look back",
        "category": "racing",
        "rating": "4.4",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/demolition-derby-3\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316109842.jpg"
    },
    {
        "id": "doodle-road",
        "title": "Doodle Road",
        "description": "Doodle Road is an imaginative and captivating 2D casual game that combines creativity with problem-solving. In this fun browser game, your primary objective is to draw a path that will successfully guide a car from the starting point to the finish line. With a multitude of levels to explore, each one introduces new challenges and exciting obstacles that test your creativity and strategic thinking. Draw your way to victory and see how far your creativity can take you!\r\n\r\nHow to Play Doodle Road\r\nYou start in Doodle Road by practicing drawing a straight line from the car to the target. Sounds simple, right? Wait until you see how straight your line really is! The true challenge is how easy it is for your car actually to drive across that path.\r\n\r\nNext challenge – draw a line to the target, but now there's a wall in your way. Remember, your car can’t fly! So, think about how to draw your path – you don’t have to go over the wall; you can go under it! As you go, you'll see that drawing a straight line is harder than it looks. If you don’t start the line from behind your car, it’ll just dangle off into oblivion.\r\n\r\nHow do you get over an L-shape? Or a huge gap in the ground? And the challenges keep coming. By level 5, your engine shuts off, so you’ll need your physics brain to figure out how to use hills and momentum to get across.\r\n\r\nSome levels have trampoline-like springs that’ll launch you toward your target. The challenges change each time, keeping you on your toes. Buckle up because it's going to be a bumpy ride, depending on how well you draw!\r\n\r\nMore Games Like This\r\nThe fun has just begun! Browse our casual games, including Marble Run, a fun simulation game where you create your own marble run using a range of tools. Other casual games worth playing include World’s Hardest Game, a causal game that certainly lives up to its name all these years later, or Gold Miner, a classic casual mining game reminiscent of the early 2000s that has captivated players for years.\r\n\r\nRelease Date\r\nAugust 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nDec 23, 2024\r\n\r\nControls\r\nLeft mouse button to draw a line.\r\nRestart button or R to restart.\r\nStart button or Space to start.\r\nFAQ\r\nHow to play Doodle Road game?\r\nThe objective of Doodle Road is to draw the perfect path to guide your car from start to finish in an addictive and creative browser game!\r\n\r\nHow to play Doodle Road game with engines off?\r\nWhen you reach a level with your engine off in Doodle Road, you will need to use your physics-based logic as much as possible. Try to create velocity curves to propel your car as much as possible",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/doodle-road\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316223927.jpg"
    },
    {
        "id": "rally-racer-dirt",
        "title": "Rally Racer Dirt",
        "description": "Rally Racer Dirt is a rally drift-based game, allows you to drift on both asphalt and dirt terrains while navigating through hills. This category is redefined with the introduction of Rally Racer Dirt, offering the best realistic and stunning controls for a rally game. Enjoy the experience of drifty and realistic tuned physics, coupled with detailed graphics, various vehicles, and racing tracks. Be a rally racer, driving like Ken Blocks and Collin McRae on the tracks. The game features a Realtime Multiplayer Mode, 13 different rally cars, tunable cars with adjustable features, upgradable cars and drive properties, 5 different tuned tracks, and more. Choose between two main game modes: Challenge mode, with 60 different challenges to pass, and Survival mode, where you drift and drive as long as you can, passing checkpoints.\r\n\r\nRelease Date\r\nJanuary 2015 (Android)\r\nMarch 2015 (iOS)\r\nNovember 2023 (WebGL)\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nLast Updated\r\nMar 26, 2025\r\n\r\nControls\r\nWASD or arrow keys = vehicle control\r\nSpace or Q = handbrake\r\nC = change camera",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/rally-racer-dirt\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316340014.jpg"
    },
    {
        "id": "assault-bots",
        "title": "Assault Bots",
        "description": "We'd like to hear your feedback. Share your experience via this form to help us improve Assault Bots.\r\n\r\nAssault Bots (previously Bot Machines) is an excellent real-time multiplayer vehicle battle game made by Blayze Games. Choose from an array of weapons, jump into the battlefield, and obliterate your opponents. Blayze games also make Bullet Force, Plated Glory, and more highly popular games!\r\n\r\nRebrand\r\nThe game has been rebranded as Assault Bots since 21 December 2020.\r\n\r\nBot Battles\r\nThe vehicular combat in Assault Bots is immense fun. The simple mechanics leave considerable room for you to harness your strategic and aiming skills to blow up your enemies, which quickly becomes an addictive and enjoyable experience.\r\n\r\nTeam Deathmatch\r\nThe game mode now uses team deathmatch. Work together with your teammates to eliminate as many opponents as possible within the time limit!\r\n\r\nCapture the Flag (legacy mode)\r\nAs well as destroying the opposition, you must capture as many flags as possible, as this is the critical objective. You capture flags by keeping your vehicle within the capture range of the flag while defending your position against enemies. This is where you can implement your personal and team strategy to get a competitive edge over the other side!\r\n\r\nCustomize\r\nOne of the aspects of Assault Bots that keeps the gameplay fresh is the ability to switch up your arsenal of weaponry. In any game, you'll have two slots free to choose from an array of weapons, including a minigun, machine gun, RPG, grenade launcher, and more. Each weapon has its strengths and weaknesses.\r\n\r\nYou can also apply add-ons like health-regen and turbo, as well as customizing the body and movement of your vehicle to create your favorite Assault Bots for Battle.\r\n\r\nRelease Date\r\nJune 2020\r\n\r\nDeveloper\r\nBlayze Games is the developer of Assault Bots. They develop several popular online games like Forward Assault and those mentioned at the top of the description.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\nLast Updated\r\nSep 18, 2024\r\n\r\nControls\r\nWASD or arrow keys = move\r\nLeft-click = aim and shoot\r\nRight-click = Zoom\r\n1 and 2 = switch weapons\r\nSpace = hand brake\r\nShift = turbo\r\nE = jump\r\nR = reload\r\nT = chat\r\nTab = view scoreboard\r\nEsc = pause",
        "category": "racing",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/bot-machines\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316518137.jpg"
    },
    {
        "id": "mr-racer",
        "title": "Mr. Racer",
        "description": "Mr Racer—Car Racing is a thrilling racing game in our driving category in which you zoom through busy streets in various locations. Drive at high speeds in a variety of stunning supercars, dodging traffic. Tackle a range of driving challenges and become the ultimate MR RACER.\r\n\r\nHow to Play Mr Racer\r\nStart your racing journey with speed into the action! In Mr. Racer, there are various game modes that offer an exciting driving experience in a range of flashy automobiles. Speed your way through 5 unique locations, progressing your career as a racing driver and earning EXP to level up.\r\n\r\nChallenge. Complete various challenges to progress through the game. In challenge mode, there are 100 different challenges to complete, keeping the game fresh and offering tricky new tasks. Most of the challenges are time-based. You earn back some time by fast overtaking other vehicles.\r\n\r\nRace. In race mode, you’ll compete against another racer to place first. There are no bonuses for fast overtakes, so focus on beating your opponent to successfully complete the mission.\r\n\r\nChase. When you unlock chase mode, you’ll enjoy an unlimited number of chases. Chase the opposition down and show them who the master racer is!\r\n\r\nBuy and upgrade new vehicles\r\n\r\nAs you progress through the game and explore the various game modes on offer, you’ll earn money to buy new vehicles. There are various cars, some of which are incredibly fast. These newer vehicles will help you beat your opponents in races more easily.\r\n\r\nYou can also upgrade your vehicles with new paint jobs, wheels, lights, and wheel stances.\r\n\r\nMore Games Like This\r\nAre you looking for more supercar action after completing Mr. Racer? Check out more of our driving games or car games. Some other popular driving games are Drift Hunters, which lets you master the art of drifting, and Moto X3M, offering adrenaline-pumping motorcycle stunts on challenging tracks\r\n\r\nFeatures\r\nVarious game modes to challenge your racing abilities\r\n15 supercars to unlock and take to the tracks\r\nStunning 3D graphics & realistic lighting\r\nSwitch your view to 3 different camera angles\r\n5 realistic locations: Farmland, City, Mountain Day, Mountain Night, and Snow\r\nEncouragement from Maria!\r\nRelease Date\r\nAugust 2020 (Android)\r\nDecember 2023 (WebGL)\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nDec 04, 2024\r\n\r\nControls\r\nW \/ up arrow key = accelerate\r\nA \/ left arrow key = steer left\r\nD \/ right arrow key = steer right\r\nS \/ down arrow key = brake\r\nH = horn\r\nFAQ\r\nHow many cars are there in Mr. Racer?\r\nThere are currently 15 cars ranging from supercars to SUVs.\r\n\r\nHow to honk in Mr Racer?\r\nYou can use the H key to honk in Mr Racer.\r\n\r\nCan I upgrade my car in Mr. Racer?\r\nYou can only buy cosmetic upgrades for your car.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mr-racer---car-racing\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316631415.jpg"
    },
    {
        "id": "room-escape-strange-case",
        "title": "Room Escape: Strange Case",
        "description": "Room Escape: Strange Case is a mystery puzzle game where you, the true detective, delve into the enigma of the elusive \"Alchemist.\" Unravel the chilling tale of defiled graves, navigating through a unique graphic style and atmospheric puzzles. Encounter strange characters and escape clever traps in your quest to unveil the Alchemist's identity. Are you up for the challenge of this original and mysterious adventure? You can also watch the walkthrough for chapter 1, chapter 2, and chapter 3.\r\n\r\nRelease Date\r\nSeptember 2019 (Android)\r\nDecember 2020 (iOS)\r\nNovember 2023 (WebGL)\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nFeb 17, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with objects.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/room-escape-strange-case\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316826103.jpg"
    },
    {
        "id": "game-911-prey",
        "title": "911: Prey",
        "description": "911: Prey is a scary horror game with puzzles. In this game, you are a kidnapped teenager that needs to escape from a cannibal maniac who brought you to his house. Search for any useful items to help you get out of his house. Be very careful and cover up your tracks so that the maniac does not suspect anything!\r\n\r\nFeatures\r\nMultiple endings - it all depends on your actions\r\nBranching detective story\r\nInteresting puzzles\r\nFascinating story and investigation\r\nHorror elements, hide and seek, and survival\r\nQuality sound and detailed environment\r\nRelease Date\r\nJuly 2023 (Android and iOS)\r\nAugust 2023 (WebGL)\r\nDeveloper\r\n911: Prey is made by Euphoria Games.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nNov 22, 2024\r\n\r\nControls\r\nPC\r\nWASD = move\r\nF \/ left-click = use item\r\n1-6 = select inventory item\r\nC = sit down \/ crouch\r\nH = hint\r\nP = pause\r\nMobile\r\nUse the joystick and buttons on the screen.\r\nCamera sensitivity can be changed in the settings.",
        "category": "horror",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/911-prey\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316911733.jpg"
    },
    {
        "id": "escape-room-strange-case-2",
        "title": "Escape Room: Strange Case 2",
        "description": "Escape Room: Strange Case 2 is an adventure-packed escape game that immerses you in a suspenseful journey through the dark and eerie corridors of a mysterious asylum. Unravel sinister secrets, solve intricate puzzles, uncover hidden clues, and unlock doors as you navigate through the haunting environment.\r\n\r\nFeatures\r\nComplex Puzzles: Decode cryptic clues and unlock challenging riddles to progress through each room.\r\nHaunting Atmosphere: Explore an asylum filled with eerie visuals and spine-chilling mysteries.\r\nImmersive Mystery: Piece together a gripping story filled with twists and surprises.\r\nOffline Gameplay: Enjoy the experience without needing an internet connection.\r\nNo Hidden Costs: Dive straight into the action without in-app purchases or subscriptions.\r\nWill you uncover the asylum’s secrets, make it to the final exit, or succumb to its dark allure? The challenge is yours to accept!\r\n\r\nLast Updated\r\nJan 21, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with objects.",
        "category": "horror",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/escape-room-strange-case-2\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316981475.jpg"
    },
    {
        "id": "fnaf-shooter",
        "title": "FNaF Shooter",
        "description": "FNaF Shooter is a first-person shooter game where you survive and save the world from the invasion of animatronics!\r\n\r\nRelease Date\r\nFebruary 2022\r\n\r\nDeveloper\r\nGoGoMan made this game.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nControls\r\nMouse = look around\r\nWASD = movement\r\nW + Shift = run\r\nSpace = jump\r\nLeft mouse button = shoot\r\nRight mouse button (hold) = aim\r\nMouse wheel = next \/ previous weapon\r\n1-7 = weapon hotkeys\r\nR = reload\r\nG = throw a grenade",
        "category": "horror",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/fnaf-shooter\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317052356.jpg"
    },
    {
        "id": "monster-makeup-3d",
        "title": "Monster Makeup 3D",
        "description": "Monster Makeover is a creative game where you transform monsters into humans to help them blend into society. Use your skills to choose skin tones, eye lenses, teeth, and wigs, ensuring they stay hidden from angry mobs. Protect these creatures by mastering the art of disguise and helping them live peacefully among humans.\r\n\r\nFeatures\r\nExcellent 3D art style.\r\nFunny animations.\r\nHilarious Failure experience.\r\nSatisfying ASMR feel.\r\nGet a stunning response in the end.\r\nLast Updated\r\nJan 08, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with the in-game UI.",
        "category": "horror",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/monster-makeup-3d\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317148066.jpg"
    },
    {
        "id": "horror-tale",
        "title": "Horror Tale",
        "description": "Horror Tale Kidnapper is a frightening first-person horror adventure game. Solve the disturbing mystery of the missing children at Lakewitch. Who is the kidnapper, and why are they doing it? Where are the children disappearing, and how can we save them? It's up to you to find out.\r\n\r\nHow to Play Horror Tale Kidnapper\r\nIn this episode, you meet your friend Harry, who plans to keep you and the other kids from your neighborhood safe from the kidnapper while you're waiting for your parents to return.\r\n\r\nTogether with him, you will fortify the tree house so the spooky kidnapper can't get you. On the way to your goal, puzzles, moments of fear, screams, unexpected twists and turns, and lots of fun await you!\r\n\r\nFeatures\r\nMysterious and fascinating story\r\nInteresting characters with a scary antagonist\r\nPuzzles and riddles to solve\r\n5 diverse locations to explore\r\nOriginal author's soundtrack\r\nRelease Date\r\nJuly 2022 (Android and iOS)\r\nJanuary 2023 (Steam)\r\nMarch 2023 (WebGL)\r\nDeveloper\r\nHorror Tale: Kidnapper is developed by Euphoria Games.\r\n\r\nPlatforms\r\nThis game is available in web browsers (desktop and mobile) and in Android, iOS, and Steam versions.\r\n\r\nMore Games Like This\r\nOnce you've finished Horror Tale Kidnapper, there are many more frights in our adventure games category. If you're itching for something less scary, check out World's Hardest Game, House of Hazards, or Dumb Ways to Die.\r\n\r\nLast Updated\r\nNov 21, 2024\r\n\r\nControls\r\nPC Controls\r\nWASD = movement\r\nF = action\r\nC = crouch (If you crouch, the noise will be less)\r\nH = hint menu\r\nX = leave the item\r\nG = throw an item\r\nP = pause, skip cutscenes\r\nMobile Controls\r\nJoysticks and buttons on the screen. Interface transparency and camera sensitivity can be changed in the settings.\r\nFAQ\r\nWhat is the name of the kidnapper in the horror tale?\r\nThe main villain of the Horror Tale Kidnapper game is known as Chase.\r\n\r\nWhat is the age rating for Horror Tale 1 kidnapper?\r\nAccording to the App Store, Horror Tale Kidnapper is a 12+.\r\n\r\nIs Horror Tale a good game?\r\nEuphoria Games' Horror Tale Kidnapper title is a game of thrilling moments and a solid afternoon of gameplay. If you are looking for true horror, this may not fit the bill, but it offers surprises to keep you on the edge of your seat.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/horror-tale-kidnapper\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317207148.jpg"
    },
    {
        "id": "game-911-cannibal",
        "title": "911: Cannibal",
        "description": "911: Cannibal is a spine-chilling horror game where you have to escape the house of a maniacal cannibal. Playing as a kidnapped teenager, your mission is to find items that help you escape by solving various puzzles, all while covering your tracks to avoid detection. Can you outsmart the cannibal and escape his clutches, or will you be his next victim? Explore the ominous house, uncover notes, and unravel the twisted story of Minnesota's most frightening maniac.\r\n\r\nOnce you've escaped the grip of an unhinged cannibal, why not get yourself into another terrifying situation in one of our many horror games. Check out Horror Tale and Exhibit of Sorrows for two other top-rated scary games.\r\n\r\nFeatures\r\nFascinating story and investigation\r\nInteresting puzzles to solve\r\nHorror elements, hide and seek, and survival\r\nDetailed environment to explore\r\nRelease Date\r\nJanuary 2023 (Android and iOS)\r\nMarch 2023 (WebGL)\r\nDeveloper\r\n911: Cannibal is developed by Euphoria Games.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nNov 22, 2024\r\n\r\nControls\r\nPC Control\r\nWASD = move\r\nF \/ left-click = interact\r\n1-5 = use inventory items\r\nC = crouch\r\nH = hint\r\nP = pause\r\nMobile Control\r\nUse in-game joysticks and buttons on the screen. Camera sensitivity can be changed in the settings.",
        "category": "horror",
        "rating": "4.9",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/911-cannibal\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317266122.jpg"
    },
    {
        "id": "diner-in-the-storm",
        "title": "Diner in the Storm",
        "description": "Diner in the Storm is a puzzle adventure game that plunges you into a heart-pounding escape adventure, where danger lurks not only outside but within the walls of a seemingly ordinary roadside diner. Caught in the grip of a sudden and ominous storm, you seek shelter in a roadside diner, only to find that safety is fleeting, and the diner harbors dark secrets. As the storm rages on, you must solve a series of intricate puzzles that push your logic, wit, and nerves to the limit. Each puzzle reveals new mysteries about the diner’s hidden past.\r\n\r\nHow to Play Diner in the Storm\r\nIn Diner in the Storm, every interaction brings you deeper into the mysterious world of this stormy night. As soon as you enter the diner, you're greeted by Maggie, the friendly yet wary waitress.\r\n\r\nMaggie: \"Come on in, sweetheart, and close the door behind you. This storm isn’t letting up anytime soon. Grab a seat—I’ll bring you a hot coffee and the menu.\"\r\n\r\nMaggie gestures towards the radio, giving you a subtle hint: \"Feel free to change the music if you want.\"\r\n\r\nAs you settle in, the game’s atmosphere intensifies. You begin to overhear snippets of a conversation from a nearby booth. Ethan, a jittery customer, is talking to Edith, though she doesn’t seem interested.\r\n\r\nEthan: \"Did you see anything weird in the sky on your way here?\"\r\n\r\nEdith: \"Ugh, here we go again…\"\r\n\r\nEthan, undeterred, leans in: \"I swear, we saw something huge—like flickering lights—just before the storm hit. Well... I saw it anyway.\"\r\n\r\nAt this point, you’re prompted to decide how to respond. Asking the right question might nudge Ethan to reveal something eerie, like: \"I’m telling you, it was aliens. No way that was just lightning!\"\r\n\r\nAs you explore further, another patron, Juan, catches your eye. His reaction is far from friendly.\r\n\r\nJuan: \"What are you looking at?\"\r\n\r\nHis aggressive tone suggests you should steer clear, and the game allows you to choose whether to confront him or simply move along. Either way, he doesn’t seem like someone who wants company.\r\n\r\nWandering through the diner, you spot a woman who seems familiar. She notices your glance and quickly cuts you off: \"No photos, no autographs.\"\r\n\r\nYou ask who she is, and the game reveals that she's none other than Bruna Starr, a social media sensation. \"Bruna Starr, three million followers. You seriously don’t know me?\"\r\n\r\nYou can respond, \"I’m not on the app. I listen to the radio instead.\"\r\n\r\nShe shrugs, her voice detached: \"Well, I travel a lot. Guess you could say I’m off the grid.\"\r\n\r\nAnother figure, Csapar, an older, mysterious man, sits alone at a booth. When you ask to join him, he nods quietly.\r\n\r\n\"I’m no ghost,\" he says with a knowing smile, \"but I’ve got stories that might make you believe otherwise.\"\r\n\r\nIn Diner in the Storm, these conversations aren't just filler—they lead you deeper into the puzzle-filled world, where every dialogue unlocks new clues about the diner, its patrons, and the strange forces at play outside. Your goal is to uncover the truth behind the storm—or become another unsolved mystery.\r\n\r\nThere are multiple scenarios that can take place, but your ultimate goal is to get everyone out of the diner and to safety in a town nearby named Hope Springs.\r\n\r\nMore Games Like This\r\nDiner in the Storm is a unique experience for puzzle game lovers! Browse popular titles like Mahjongg, Match the Color, The Impossible Quiz, Nonogram and more.\r\n\r\nRelease Date\r\nJanuary 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nMar 14, 2024\r\n\r\nControls\r\nLeft mouse button to interact.\r\n(Optional) AD, left\/right arrow keys, and space to move left and right.\r\nFAQ\r\nWhat is the story of Diner in the Storm?\r\nDiner in the Storm takes you through a seemingly ordinary evening where your character is caught in a storm and stops at a nearby diner for shelter. You speak to all the patrons in a similar situation, and the story soon unfolds...\r\n\r\nHow do you get Maggie to comes with you in Diner in the Storm?\r\nMaggie will come with you only after you have spoken to Caspar about Maggie.\r\n\r\nWhen did Diner in the Storm come out?\r\nDiner in the Storm was released on January 5, 2024 by developer Maxim Tsai.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/diner-in-the-storm\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317315357.jpg"
    },
    {
        "id": "haunted-school",
        "title": "Haunted School",
        "description": "Haunted School is a horror survival game where you search a school for the tools required to exorcise a demonic child. Explore the map looking for clues and supplies. How long will you survive the Haunted School?\r\n\r\nSearch for answers\r\nRoam the corridors of this ravaged school in search of answers. Solve the puzzles and find the priest's tools so you can banish the demonic girl before it’s too late.\r\n\r\nSurvive the horrors\r\nEarly in the game, you’ll find a shotgun. You can use this to shoot the girl away before she kills you, but it will only rid you of her temporarily. If you run out of ammo, then all you can do is run and hope you don’t become demon food. The priest has left notes as clues throughout the Haunted School. Follow them for advice.\r\n\r\nPrepare for jump scares\r\nHaunted School gets progressively scarier and utilizes jump scares and tension to put you on the edge of your seat. The vibe is similar to other famous survival horror games like Silent Hill and Amnesia: The Dark Descent. Expect unforgiving frights.\r\n\r\nYou can find more games like this in the horror and scary categories.\r\n\r\nRelease Date\r\nApril 2022\r\n\r\nDeveloper\r\nHaunted School - Horror Game is made by Tonny Nevel.\r\n\r\nPlatforms\r\nWeb browser\r\n\r\nLast Updated\r\nMar 16, 2023\r\n\r\nControls\r\nWASD or arrow keys = movement\r\nE = pick-up item\r\nR = reload\r\nC = crouch\r\nLeft-click = sprint\r\nLMB = shoot\r\nG = drop item\r\n1 \/ 2 = change slot\r\nESC = pause",
        "category": "horror",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/haunted-school---horror-game\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317376675.jpg"
    },
    {
        "id": "exhibit-of-sorrows",
        "title": "Exhibit of Sorrows",
        "description": "Exhibit of Sorrows is a short horror game set in a curious circus-themed exhibit. Explore this strange interactive museum, follow instructions, and don’t upset the clown!\r\n\r\nHow to Play\r\nNot all is well in the Exhibit of Sorrows. Move through this progressively creepy exhibition and check out the strange dolls on display. Interact with the dolls to reveal the keys. Be prepared to do terrible things to escape.\r\n\r\nThe mood get darker and more unsettling as you progress. You will encounter the same exhibitions in disturbing new forms as you become increasingly more panicked to escape. You will have to make cruel decisions in order to leave.\r\n\r\nRegardless of the sinister undertone to the game, there is a story to learn that will keep you gripped to the end. Exhibit of Sorrows is an excellent horror game worth seeing through.\r\n\r\nFeatures\r\nOriginal concept\r\n10-minute playtime\r\nUnsettling experience\r\nFree to play\r\nMore Scary Games\r\nBrowse our horror and scary categories for more strange, creepy, and terrifying games. Check out Horror Tale and FnAF Shooter next.\r\n\r\nRelease Date\r\nApril 2022\r\n\r\nDeveloper\r\nMaxim Tsai developed this game.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nLast Updated\r\nDec 17, 2024\r\n\r\nControls\r\nUse the left mouse button to interact and collect the keys.\r\n\r\nFAQ\r\nWhere can I play Exhibit of Sorrows for free?\r\nYou can play it for free on CrazyGames.com\r\n\r\nHow many endings are there in Exhibit of Sorrows?\r\nThere is only one ending in this game.",
        "category": "horror",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/exhibit-of-sorrows\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317420879.jpg"
    },
    {
        "id": "scary-horror-escape-room",
        "title": "Scary Horror Escape Room",
        "description": "Scary Horror Escape Room is a creepy escape room game set in a mysterious place. Solve tricky puzzles and escape the place alive!\r\n\r\nRelease Date\r\nNovember 2019 (Android and iOS)\r\nOctober 2022 (WebGL)\r\nDeveloper\r\nArpaplus made this game.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 05, 2022\r\n\r\nControls\r\nUse the left mouse button to interact with the objects and follow the in-game tutorial.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/scary-horror-escape-room-games\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317478830.jpg"
    },
    {
        "id": "squid-game-online",
        "title": "Squid Game Online",
        "description": "Squid Game Online is a free multiplayer survival game. Compete in 7 minigames with 30 players based on the viral Netflix show Squid Game. If you fail any of the challenges, you will be eliminated by the Pink Soldiers.\r\n\r\nHow to Play Squid Game\r\nTo enter a game, choose your region and nickname, then click join. You’ll be added to a room and be moments away from playing in this unforgiving challenge! In the first mini-game, you’ll have to sneak towards the doll without being seen in Red Light, Green Light.\r\n\r\nThe Best Squid Game\r\nThe arrival of Squid Game to Netflix has led to several spin-off game titles for mobile and web browsers. Squid Game Online is one of the best and most popular Squid Games because of the immense online matches and challenging mini-games. Jump into the game and avoid being shot by the Masked Men!\r\n\r\nMore Games Like This\r\nCheck out the version of Squid Game created by Kogama for another spin-off. Other popular online survival games include Impostor Royale and Fall Beans.\r\n\r\nFeatures\r\nSurvive seven grueling challenges\r\nPlay online with 30 players in one room\r\nIt’s a multiplayer Squid game on the web\r\nThe more you play, the more you'll master Squid Game!\r\nGames List\r\nRed Light, Green Light\r\nDalgona Candy\r\nTug of War\r\nMarbles\r\nGlass Stepping Stones\r\nJudgment Night (if more than 2 alive players)\r\nSquid Game\r\nLast Updated\r\nMar 17, 2025\r\n\r\nControls\r\nWASD or arrow keys = move\r\nSpace = jump\r\nLMB = scratch cookie \/ drag rope \/ hit\r\nE = pickup weapon\r\nG = drop weapon\r\nT = chat\r\nFAQ\r\nWhat is the best Squid Game?\r\nSquid Game Online created by Dimofan is one of the most popular new games inspired by Squid Game.\r\nCan you play Squid Game with other players?\r\nYes! Squid Game Online features multiplayer mini-games with other players via the internet.\r\nIs Squid Game Online free?\r\nYes, you can play this game for free in your web browser - no download required.",
        "category": "action",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/squid-game-online\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317727556.jpg"
    },
    {
        "id": "defender-idle-2",
        "title": "Defender Idle 2",
        "description": "Defender Idle 2 is an endless idle defense game where you unlock slots, strategically place turrets, and invest in a wide range of upgrades to safeguard your base. Your mission is to fortify your defenses and conquer the relentless onslaught. Can you outlast the ever-growing threats and emerge as the ultimate defender?\r\n\r\nRelease Date\r\nJune 2019\r\n\r\nDeveloper\r\nDefender Idle 2 is made by Barbas.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nLast Updated\r\nFeb 18, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with the in-game UI\r\nQ = previous wave\r\nW = retry wave\r\nE = next wave\r\nR = sell mode\r\nA = research\r\nS = passives\r\nD = production\r\nF = technology\r\nG = menu\r\nZ = artifacts\r\nX = mining\r\nC = gambler's forge\r\nV = surrender",
        "category": "action",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/defender-idle-2\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317898901.jpg"
    },
    {
        "id": "stickman-destruction-3-heroes",
        "title": "Stickman Destruction 3 Heroes",
        "description": "Stickman Destruction 3 Heroes is a ragdoll physics action game. Crash the stickman into obstacles, send him tumbling down staircases and through walls into oblivious bystanders. Cause as much destruction as possible to earn the most gold!\r\n\r\nCause Carnage\r\nStickman Destruction 3 Heroes is all about inflicting high impact to your stickman and anything in his way. The results will vary depending on how much force you apply, combined with a spot of random luck. You can set your character in various starting positions to find out what causes the most chaos.\r\n\r\nExtra-high impacts happen in slow-motion for your amusement.\r\n\r\nBuy Upgrades\r\nThe points you acquire at the end of the level accumulate. You can use your gold points to buy new vehicles that drastically increase your potential to do damage. You can even eject from the vehicle and go catapulting through walls and into other props.\r\n\r\nAs well as buying vehicles, you can use your hard-earned gold to purchase levels, characters, and props to set up the perfect stickman apocalypse scenario for your entertainment. Why not blow him to bits with TNT? It’s possible, but you have to earn your way to that level of fire power.\r\n\r\nMore Games Like This\r\nDid you enjoy playing Stickman Destruction 3 Heroes? Browse our stickman games to find more stickman action games with the same theme. For a game where you have to avoid obstacles rather than crash into them, check out House of Hazards.\r\n\r\nFeatures\r\nSend your stickman on a trail of destruction\r\nUnlock vehicles to create extra impact\r\nVarious levels with different damage setups\r\nA host of props to use to inflict maximum damage\r\nRelease Date\r\nSeptember 2017 (Android)\r\nAugust 2018 (iOS)\r\nMarch 2021 (WebGL)\r\nDeveloper\r\nStickman Destruction 3 Heroes is developed by Sergey Mezhakov. Check out his game Stickman Supreme Duelist 2 for a crazy stickman game featuring combat with an array of weapons.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\niOS\r\nControls\r\nLeft mouse button",
        "category": "action",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/stickman-destruction-3-heroes\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743427098094.jpg"
    },
    {
        "id": "bank-heist",
        "title": "Bank Heist",
        "description": "Bank Heist is an action-packed game filled with thrilling adventures where you rob banks, stores, and more! Strategize, fight, and escape with the loot in this high-stakes crime escapade. Get ready to live the life of a master thief in Bank Heist!\r\n\r\nLast Updated\r\nJan 21, 2025\r\n\r\nControls\r\nWASD = move\r\nSpace = jump\r\nC = crouch\r\nShift = run\r\nF = interact with entities\r\nLMB = fire with weapon\r\nRMB = aim\r\nTab = exit",
        "category": "strategy",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/bank-heist\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431566966.jpg"
    },
    {
        "id": "build-and-crush",
        "title": "Build and Crush",
        "description": "Build and Crush is a multiplayer game in which you can, you guessed it, build and crush stuff. Choose your own fun!\r\n\r\nHow to Play Build and Crush\r\nBuild\r\n\r\nPlace blocks or animals to build something cool. There are normal blocks (bricks, granite, glass, wood, leaves, etc.) and color blocks. Each block can have multiple variations: column, stair, and triangle. Don't forget to save what you build, and when you are happy with it, you can make your creation public with a single click on the \"Make public\" button.\r\n\r\nCrush\r\n\r\nThis is where the fun begins. Select a random creation, and use the various weapons to blow everything up. Explode everything with TNT, shoot it with a cannon, trigger an earthquake, or put everything on fire! Pst, if you want a 1-click annihilation, use the atomic bomb ;) A real-time multiplayer mode will also arrive soon, where you can compete against other players, defend from zombies, and do other cool stuff!\r\n\r\nMultiplayer: Work together with other players in various game modes.\r\n\r\nRelease Date\r\nNovember 2019\r\n\r\nDeveloper\r\nCtrl4ltDel made Build and Crush.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nMore Games Like This\r\nIf you like Build and Crush, you might want to browse our full selection of action games. You can try some of our more popular games like Jacksmith, Cuphead, or Battleship.\r\n\r\nLast Updated\r\nAug 20, 2024\r\n\r\nControls\r\nBuild Controls\r\nW, A, S, D: move\r\nShift\/Space: fly up\/down\r\nLeft-click: destroy blocks\r\nRight-click: place blocks (additional controls are displayed in the game)\r\nCrush Controls\r\nLeft-click: select weapons from the bottom part of the screen\r\nF: enter free flight mode\r\nC: load another random creation\r\nFurther controls depend on what weapon you selected, and displayed on the screen. You can always change the key bindings in Settings.\r\n\r\nFAQ\r\nIs Build and Crush a game?\r\nYes, Build and Crush is a multiplayer action game where you get to build your own world, but be ready to watch them go down as your opponents will destroy them if you don’t destroy theirs first.\r\n\r\nWhat is the game where you build stuff?\r\nBuild and Crush is an action game where you build your structures… and then destroy them.\r\n\r\nCan I play Build and Crush on mobile?\r\nBuild and Crush is available on desktop only.\r\n\r\nCan I play Build and Crush for free?\r\nYes, you can play Build and Crush and many more similar games for free at CrazyGames.",
        "category": "action",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/build-and-crush\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743427399256.jpg"
    },
    {
        "id": "world-z-defense-zombie-defense",
        "title": "World Z Defense - Zombie Defense",
        "description": "World Z Defense - Zombie Defense is a thrilling action defense game where players must fight against hordes of zombies trying to overrun the world. In this post-apocalyptic scenario, your mission is to defend cities across the globe by strategically placing soldiers with different weapons, each offering unique stats like damage, shooting speed, and reload speed.\r\n\r\nHow to Play World Z Defense\r\nThe world is in chaos, and only you can save it. World Z Defense puts you on the front line of a global zombie outbreak, and it’s up to you to save humanity. No pressure. You will start at an ammunition base, where you can recharge your ammunition and prepare for the relentless zombie onslaught. Zombies may be slow, but they’re persistent and will stop at nothing to break through your defenses.\r\n\r\nTo defend yourself, click, drag, and drop your character to aim at approaching zombies. Once you’ve aimed, your position is locked, and all your bullets fire in the chosen direction until you return to the ammunition base. Timing is everything—your ability to take down multiple zombies at once depends on careful planning and aim.\r\n\r\nAs you play, you’ll earn rewards that allow you to upgrade your character, improving crucial stats like reload time and firepower. These upgrades become essential as the hordes grow larger and faster, leaving you less time to react. If zombies break through your barricade, it’s game over—so don’t let your guard down.\r\n\r\nExplore a map filled with different geographical areas, each teeming with zombies waiting to be defeated. Your strategy is key: try to line up as many zombies as possible in your line of fire, as you can only shoot in one direction when away from the ammunition base. Use your resources wisely to become a more potent fighter and save the world from the undead menace. You've got this!\r\n\r\nMore Games Like This\r\nWhy stop the excitement here? Keep the adventure going with some of our top action games: craft powerful weapons and join the fight against monsters in Jacksmith; train a determined duckling to become an elite athlete and rebuild the farm in Ducklife; or take charge of a team of fearless heroes and lead your world to triumph in Far Orion: New Worlds.\r\n\r\nLast Updated\r\nNov 19, 2024\r\n\r\nControls\r\nUse the left mouse button to select and drop Soldiers and interact with in-game UI.\r\n\r\nFAQ\r\nWhat is the oldest tower defense game?\r\nOne of the oldest tower defense games is said to be Rampart, which was released in 1990. Though it was not classified as a tower defense game at the time, it was the prototype of today's genre.\r\n\r\nWhy are tower defense games fun?\r\nTower defense games are fun for several reasons, one of which is due to their simplicity in objective and focused approach to battle.",
        "category": "action",
        "rating": "4.9",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/world-z-defense---zombie-defense\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743429751440.jpg"
    },
    {
        "id": "cat-and-granny",
        "title": "Cat and Granny",
        "description": "Cat and Granny is a chaotic first-person simulator where you play as a clever orange cat determined to outsmart the new black cat that Granny brought home! Cause havoc by knocking over flower pots, scattering objects, and scratching up furniture—all while making Granny believe the black cat is to blame.\r\n\r\nExplore a house filled with destructible items, set up the perfect pranks, and watch as Granny reacts to the growing chaos. Can you outmaneuver your feline rival and reclaim your rightful place as Granny’s favorite?\r\n\r\nFeatures\r\nInteractive environments packed with breakable objects\r\nA unique twist—frame the black cat for your mischievous deeds\r\nHilarious reactions from Granny as she falls for your tricks\r\nSimple, fun, and highly addictive gameplay\r\nUnleash your inner troublemaker and take back your territory in Cat and Granny!\r\n\r\nLast Updated\r\nFeb 11, 2025\r\n\r\nControls\r\nPC Controls\r\nWASD = move\r\nMove mouse = move the camera view\r\nSpace = jump\r\nF = interact with an object\r\nQ = hide in the box\r\nTab = main menu\r\nR = hint\r\nMobile Controls\r\nUse the in-game buttons to play the game.",
        "category": "action",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/cat-and-granny-original\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743429832516.jpg"
    },
    {
        "id": "mergest-kingdom",
        "title": "Mergest Kingdom",
        "description": "Mergest Kingdom is a merge puzzle and match-3 game where you build your own kingdom by combining resources in groups of three. Match items to unlock new resources, complete quests, and expand your territory. With hundreds of objects to merge and challenges to complete, you can steadily grow your kingdom and shape it the way you want. Jump in and start building today.\r\n\r\nHow to Play Mergest Kingdom\r\nMine and harvest resources\r\n\r\nMergest Kingdom features hundreds of objects that can be combined in groups of 3 to create new items. You start by combining raw resources which transform into something new - like a house. Then, the houses can be combined to make a bigger house, and so on. You can merge anything from dragons to gems and trees!\r\n\r\nExplore and conquer new lands\r\n\r\nYou have complete freedom to build your magical kingdom exactly how you want. Explore new lands full of mysterious creatures and new resources. Position your buildings, and merge items how you want. This land stretches infinitely.\r\n\r\nComplete quests\r\n\r\nThe game gives you several quests to keep you busy, rewarding you with gold, gems, and more quests every step of the way. There’s also a daily quest that rewards you with gold and gems, so be sure to come back to get the quest.\r\n\r\nMore Games Like This\r\nOther fun puzzle games to check out include Candy Riddles, where matching three or more sweet treats clears the board and opens up opportunities for even more satisfying combinations. You can also test your skills with Trivia Crack, is a fun quiz game where you can test your general knowledge and learn amazing facts about the world or Fairyland Merge & Magic, a puzzle casual merge game set on an enchanting island of imagination and wonder.\r\n\r\nRelease Date\r\nApril 2021 (Android and iOS)\r\nMay 2021 (HTML5)\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nFeb 03, 2025\r\n\r\nControls\r\nDrag the left mouse button\r\n\r\nFAQ\r\nWhat games are similar to Mergest Kingdom?\r\nFarm Merge Valley is a really cool merge game that is very similar to Mergest Kingdom!\r\n\r\nIs Mergest Kingdom free to play?\r\nYes, it is 100% free to play. However, you can purchase additional rubies in the game if you want to progress more quickly.\r\n\r\nWhat are the tips and tricks for Mergest Kingdom?\r\nKeys are essential so focus on building the King’s Barracks and generating keys early on.",
        "category": "puzzle",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mergest-kingdom\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743429987875.jpg"
    },
    {
        "id": "tower-swap",
        "title": "Tower Swap",
        "description": "Tower Swap is a clever puzzle game combining match-3 mechanics with addictive tower defense gameplay. Stop the dragons from reaching your castle by building your defenses through tactical tile-matching decisions.\r\n\r\nHow to Play\r\nBuild your defenses\r\nMatch 3 pieces of the same resource to upgrade them to a weapon or defense piece. When you have 3 of the same weapon or wall beside each other, you can merge them to create more powerful units. However, merging also means less coverage over the map, so sometimes you should delay the decision to merge.\r\n\r\nProtect your castle\r\nYou have a limited number of swaps available before the dragons attack, so you have to use them wisely. Position your defenses so you can weather the attack! Before the boss round the game will show an arrow indicating the area where the drag will appear. Day 10 and day 20 are the first boss dragon levels, so you need to be prepared. Once you kill a boss, they release a large number of smaller dragons.\r\n\r\nCombine resources\r\nCombine 3 of these resources to build the following defenses:\r\n\r\nStone - creates a defensive attack tower\r\nGunpowder - builds a cannon\r\nIce - creates an ice wall\r\nLogs - creates an attack turret\r\nGold - forms a chest containing swaps and sometimes other items like TNT and anvils to immediately upgrade resources.\r\nAll of the created defenses above can then be merged again to build an even more powerful unit.\r\n\r\nSign up and join a clan\r\nIt's worth signing up for an account in Tower Swap! It is a simple process and will allow you to build a custom avatar using extensive options, join a clan to compete, earn gold, and unlock chests with rewards. At the end of each game you'll receive gold coins that you can use to buy lives and open chests early.\r\n\r\nMore Games Like This\r\nTower Swap is a unique game that combines elements from match-3 games and tower defense games. One of the most popular tower defense games is Tower Defense Clash. As for merge games, Farm Merge Valley is hard to beat!\r\n\r\nFeatures\r\nUnique mix-up of game genres\r\nCreate defenses by merging resources\r\nUpgrade defenses by merging defenses\r\nProtect your castle from endless waves of dragons!\r\nSign up to join a clan and more\r\nDeveloper\r\ncurtastic developed Tower Swap.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nFeb 17, 2025\r\n\r\nControls\r\nTap or click and drag only. Any tile can be swapped even if it doesn't make a match.",
        "category": "strategy",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/tower-swap\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431109121.jpg"
    },
    {
        "id": "hexa-sort",
        "title": "Hexa Sort",
        "description": "Hexa Sort is an addictive puzzle-sorting game that combines strategic matching and merging challenges. In this brain teaser, you will get to shuffle, stack, and strategize to create satisfying color matches. Featuring sleek 3D graphics, a dazzling array of vibrant hues, and soothing gameplay, this addictive challenge strikes the perfect balance between excitement and relaxation. Whether you’re seeking a mental workout or a calming escape, Hexa Sort delivers an experience that’s as rewarding as it is visually stunning.\r\n\r\nHow to Play Hexa Sort\r\nHexa Sort is a captivating and brain-teasing puzzle game that combines strategy with vibrant design. Your mission is to arrange hexagons on a 19-space board by matching their bold primary colors—blue, red, yellow, green, and more. To clear the board, you must place hexagons of the same color close together. Once aligned and unobstructed, they stack automatically with satisfying ASMR-inspired sound effects, but there’s a catch—they must match exactly. The smooth 3D graphics and vibrant palette make every move visually appealing, creating a relaxing yet immersive gameplay experience.\r\n\r\nThe real challenge lies in the hexagons’ multiple-layered colors, which add a clever layer of complexity. To reveal and match the colors underneath, you must first stack the top layers. This means strategic placement is key; you’ll need to position hexagons near similar colors to ensure cascading matches when the top layers are cleared. It’s a puzzle that requires both foresight and precision and as the stacks build up, so does the satisfaction of mastering each move.\r\n\r\nTo keep things engaging, Hexa Sort includes exciting power-ups and boosters, giving you the tools to overcome even the trickiest situations. Whether you’re a casual player or a puzzle enthusiast, the game’s combination of vibrant visuals, smooth mechanics, and rewarding challenges makes it as relaxing as it is addictive. Dive into Hexa Sort and discover a colorful world where strategy meets satisfaction!\r\n\r\nMore Games Like This\r\nThere are plenty of puzzle games to continue the brain-teasing fun. Try Cut the Rope, a physics-based puzzle game where you must cut ropes, collect stars, and feed your hungry monster friend; Candy Riddles, a match-3 puzzle game bursting with tasty-looking, mouth-watering sweets; or 10x10, a puzzle game inspired by Tetris.\r\n\r\nRelease Date\r\nNovember 2023 (iOS)\r\nJuly 2023 (Android)\r\nJuly 2024 (WebGL)\r\nPlatforms\r\nWeb browser (desktop and mobile\r\nAndroid\r\niOS\r\nLast Updated\r\nFeb 19, 2025\r\n\r\nControls\r\nUse the left mouse button to move the hexagon.\r\n\r\nFAQ\r\nWhat is the trick to Hexa Sort?\r\nTry to get as many similar colored tiles and all their layers as close as possible. Tiles of the same shade will cluster together, so be sure all layers are strategically positioned.\r\n\r\nHow much does Hexa Sort cost?\r\nHexa Sort is free to play at CrazyGames.",
        "category": "strategy",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/hexa-sort\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431160616.jpg"
    },
    {
        "id": "piles-of-mahjong",
        "title": "Piles of Mahjong",
        "description": "Piles of Mahjong is an engaging and relaxing puzzle game that combines the classic elements of Mahjong with a match-three twist. As you progress through the levels, you’ll need to clear stacks of tiles by matching three identical ones, but be careful—strategic thinking is essential to avoid getting stuck!\r\n\r\nHow to Play Piles of Mahjong\r\nPiles of Mahjong brings a fresh twist to the classic Mahjong formula with some exciting new dynamics. The game has most of the same foundational rules as a classic game of table mahjong, but instead of simply matching two tiles, your goal is to match three tiles from a pile featuring a mix of familiar patterns like circles and sticks, alongside fun new additions like bird and panda heads. To make a match, you must select tiles by clicking on them, and they’ll move to one of the seven empty spaces at the bottom of the screen.\r\n\r\nBut be careful! If you fill all seven spaces without making any triple matches, it’s game over. Strategic thinking is essential to clear the pile and avoid running out of space.\r\n\r\nThe game offers helpful features to assist you when you’re stuck, but they come with a price. You can reshuffle the tiles with 300 reward points or by watching an ad, flip all the tiles face up for the same cost, or even auto-match tiles in the bottom row with 100 reward points or an ad.\r\n\r\nTo add to the challenge, you start with two chances to remove a tile from the bottom area. Once those chances are used up, you will need to spend 100 reward points or watch an ad to earn another set of removals. These are useful if you are close to filling up your bottom spaces or if you find some tiles to pair with no space to move them to.\r\n\r\nWith its engaging twists and strategic layers, Piles of Mahjong tests your puzzle-solving skills while adding a bit of pressure to every move you make!\r\n\r\nMore Games Like This\r\nWho doesn't love a good board game? We do, which is why we have a vast selection in our puzzle collection. Try some popular titles like Solitr, Uno Online, Yahtzee Online, Rummikub, Ludo, and more. Browse our board games for even more.\r\n\r\nRelease Date\r\nAugust 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nFeb 03, 2025\r\n\r\nControls\r\nUse the left mouse button to click on any card on the board.\r\n\r\nFAQ\r\nWhat is the pile of mahjong?\r\nPiles of Mahjong is a digital puzzle board game similar to tabletop mahjong, but with a few fun twists; instead of matching two tiles, you need to match three.\r\n\r\nWhat are the pieces of mahjong?\r\nClassic Mahjong pieces include simple suits like bamboo or sticks, characters, stones, winds, and dragons. Some modernized digital games like Piles of Mahjong include tiles like pandas and birdies.",
        "category": "puzzle",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/piles-of-mahjong-jhb\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430185039.jpg"
    },
    {
        "id": "thief-puzzle",
        "title": "Thief Puzzle",
        "description": "Thief Puzzle is a clever 2D puzzle logic game that puts your problem-solving and strategy to the test. You control a sneaky thief’s hand as it reaches for valuable treasures, but the path is filled with complex traps, laser security systems, and tricky obstacles. Do you have what it takes to outsmart each trap that comes your way?\r\n\r\nHow to Play Thief Puzzle\r\nIn Thief Puzzle, you're tasked with a series of sneaky heists in various comical settings. You'll start by testing your skills in simple situations: snatching a purse from an old woman seated on a bench or grabbing groceries from two unsuspecting women from a ledge. As you progress, the challenges escalate. You’ll even swipe a tourist’s suitcase while they admire the Eiffel Tower and outwit a rival thief to steal a money bag in a museum. There’s never a dull moment as you navigate your way through each clever scenario.\r\n\r\nFrom beachside schemes where you steal a pearl from a shell to slipping into restricted areas by pickpocketing a key, every level brings new surprises. As the difficulty increases, you’ll find yourself pulling off trickier moves like swiping a diamond ring from a newly engaged couple while they’re lost in a kiss or lifting answers from a classmate’s test without getting caught by whirling fans. You’ll also have to outsmart guard dogs to steal car keys, drive away with precision, avoid TNT explosions, and—just for fun—snatch a toupee from the head of a party guest.\r\n\r\nAs the levels progress, you will need increasing sharp thinking and precise timing as you carefully plot your moves to avoid detection and snatch the prize. With every stage growing more challenging, you'll need to outwit elaborate defenses using clever strategies and creative solutions.\r\n\r\nSharp thinking alone won't cut it. You will need to calculate the perfect angles and find the shortest path to avoid detection. The puzzles are designed to challenge your wit and timing, requiring you to navigate obstacles and interact with dynamic environments. The slightest misstep could alert your target or trigger traps, so precision is key as you outmaneuver everything from dogs, furniture, and, of course, unsuspecting victims.\r\n\r\nMore Games Like This\r\nWant a few more brain-teasing games to get you scratching your head? Try more of our puzzle games and logic games like Nonogram, where you fill in spaces on a numerical grid to reveal an image or Bolts and Nuts, where you test your logic and strategic thinking with a ticking timer breathing down your neck.\r\n\r\nControls\r\nClick and hold the left mouse button to guide the thieves hand towards the target\r\n\r\nFAQ\r\nWhat is the age rating for Thief Puzzle?\r\nThief Puzzle is a fun and clever logic game appropriate for adults and children ages four and older.\r\n\r\nIs Thief Puzzle free?\r\nThief Puzzle game can be played online for free at CrazyGames.\r\n\r\nIs Thief Puzzle ok for kids?\r\nThief Puzzle is a fun and animated game that does not contain sensitive subject matter and is appropriate for kids.",
        "category": "puzzle",
        "rating": "4.3",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/thief-puzzle\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430311341.jpg"
    },
    {
        "id": "game-8-ball-billiards-classic",
        "title": "8 Ball Billiards Classic",
        "description": "8-Ball Billiards is a free online pool game in our sports category ideal for one or two players. You can play solo against AI or challenge other players in two-player mode. The game is easy for anyone to play, so pick up a cue and line up your first shot.\r\n\r\nHow to Play 8 Ball Billiards Classic\r\n8 Ball Billiards Classic is much like the classic in-person game -- your goal is to pocket all your balls (either solids or stripes) and sink the 8-ball to win. Use your mouse to aim the cue stick and adjust the power of your shot. Click and drag the cue stick back to set your shot’s power, then release it to strike the cue ball. This is a 2-player game, so carefully plan each shot to outmaneuver whoever you're playing with and clear the table before they do!\r\n\r\nPick a ball\r\n8-Ball Billiards is an intuitive billiards game where you must pot all striped or spotted balls, depending on what you're assigned to. The balls you’re assigned depend on what ball is potted first so shoot for the win!\r\n\r\nLine up your cue\r\nThe controls are easy. Simply click and drag to find the right level of force, then line up the angle with the ball that seems easiest to pot next. Remember that this is pool, so save the 8-ball until you have potted all your balls—otherwise, you will lose!\r\n\r\nFeatures\r\nEasy and intuitive controls\r\nPlay against the computer or a friend\r\nKeep track of your stats\r\nSmooth graphics and animations\r\nSave your in-game progress to your CrazyGames account\r\nMore Games Like This\r\nTake a look at our sports games or other pool games collection for more cue-based games. Popular sports titles include Basketball Stars, which offers fast-paced hoops action, and Soccer Random, which delivers unpredictable and fun soccer matches. For a nostalgic twist, Backyard Baseball lets you enjoy America’s favorite pastime in a playful backyard setting.\r\n\r\nRelease Date\r\nApril 2018\r\n\r\nPlatforms\r\nThis game is a web browser game (desktop and mobile).\r\n\r\nLast Updated\r\nApr 09, 2024\r\n\r\nControls\r\nMove your mouse to aim\r\nDrag the left mouse button backward to set power and release it to shoot\r\nFAQ\r\nHow can I change the difficulty in 8 Ball Billiards Classic?\r\nYou can adjust the difficulty in the settings menu. There are 5 preset difficulty levels for the AI.\r\n\r\nIs 8 Ball Billiards online?\r\nNo, it's a local singleplayer and multiplayer game.\r\n\r\nIs 8 Ball Billiards Classic a two player game?\r\nYou can play 8 Ball Billiards Classic with a friend or on your own against AI. It is a two-player game.",
        "category": "sports",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/8-ball-billiards-classic\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430380986.jpg"
    },
    {
        "id": "crazy-flips-3d",
        "title": "Crazy Flips 3D",
        "description": "Crazy Flips 3D is an awesome sports game to do perfect flips, such as frontflips, backflips, and gainer tricks from high cliffs.\r\n\r\nRelease Date\r\nJuly 2021\r\n\r\nPlatform\r\nWeb browser\r\n\r\nControls\r\nHold and release the left mouse button",
        "category": "sports",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/crazy-flips-3d\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430458151.jpg"
    },
    {
        "id": "game-8-ball-pool-billiards-multiplayer",
        "title": "8 Ball Pool Billiards Multiplayer",
        "description": "8 Ball Pool Billiards Multiplayer is a competitive sports pool game that lets you test your skills in exhilarating 2-player matches against friends or go head-to-head with players from around the world. Perfect your game by competing against expert bots to sharpen your strategies and techniques. Whether you’re aiming to outwit a friend or conquer global rivals, every shot counts in your quest to become the ultimate billiards champion.\r\n\r\nHow to Play 8 Ball Pool Billiards Multiplayer\r\n8 Ball Pool Billiards is just like your classic pool game, where your objective is to pot your balls into the pockets. This game adds a fun twist in that you can play with random players from all around the world, helping you enhance your game to a pro-level with continued practice.\r\n\r\nThe game begins with a break shot where you hit the cue ball to scatter the other balls. Your objective is to pot the balls into pockets using the cue ball where possible. The first break will tell you whether you are stripes or solids, depending on what ball you get in the pocket first.\r\n\r\nIn each turn, aim to strike the cue ball to hit your target ball into a pocket. If successful, you continue your turn; otherwise, your opponent takes their turn. The key is to use strategic shots to position the cue ball for the next play and try to control the table by positioning balls to your advantage. The direction of where your ball will land is outlined from the stick to the ball with an arrow, giving you an indication of the target path.\r\n\r\nThe player who pots all their balls first wins the game.\r\n\r\nChoose from numerous game rooms such as a private two-player game between you and your friend, a quick play game where you choose your level and play against the public quickly, or a local play where you may need to wait a bit to be matched with a live partner.\r\n\r\nMore Games Like This\r\nIf you want to explore more sports games online, browse our selection of popular titles, which include Basketball Stars, Basket Random, Backyard Baseball, A Small Word Cup, and more.\r\n\r\nRelease Date\r\nAugust 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nControls\r\nPC\r\n\r\nPress and hold the left mouse button, then drag to adjust power. Release the button to shoot.\r\n\r\nMobile\/Tablet\r\n\r\nSlide your finger to aim. Drag and hold the power meter to set power, then release it to shoot.\r\n\r\nFAQ\r\nDoes 8 Ball Pool have a multiplayer?\r\n8 Ball Pool Billiards Multiplayer can be played solo or with friends online.\r\n\r\nCan we play 8 Ball Pool with friends?\r\nYou can play 8 Ball Pool Billiards Multiplayer with friends as it is a multiplayer game!\r\n\r\nCan you play 8 ball pool online?\r\nYou can play 8 Ball Pool Billiards Multiplayer online at CrazyGames.",
        "category": "sports",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/8-ball-pool-billiards-multiplayer\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430551702.jpg"
    },
    {
        "id": "basketbros",
        "title": "BasketBros",
        "description": "BasketBros is a fast-paced basketball game with online and offline gameplay. Choose a basketballer, customize your style, and compete in singleplayer and multiplayer games. Throw down some sick dunks and win the game to earn upgrades and unlockables.\r\n\r\nHow to play Basket Bros\r\nCustomize your Basket Bro\r\nSelect your player and pick what to wear - then choose some colors to personalize your drip. There are loads of characters and clothes to unlock the more you play BasketBros.io.\r\n\r\nPlay fast-paced basketball games\r\nGet on the court and into the action straight away. You can play quick games or enter a tournament. Fight your opponent for the ball using hand-to-hand combat and outscore them to win the game and move on.\r\n\r\nPlay with friends\r\nPick a username and go dunk on some fools in the online mode! You can also play two-player on the same PC with a friend of your choice.\r\n\r\nPractice\r\nPractice makes perfect! At the least, it will make sure you don't get completely rolled when you hit online mode. Head to the practice mode to test out and hone your b-ball skills.\r\n\r\nSimilar Games\r\nCheck out our basketball games for more court-based ball battles. Similar titles include Basketball Stars, Basketball Legends, and Basket Random.\r\n\r\nRelease Date\r\nJanuary 2020\r\n\r\nDeveloper\r\nBasketBros is owned by the same developer as ShellShockers.io, Blue Wizard Digital.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nLast Updated\r\nMar 20, 2025\r\n\r\nControls\r\nWASD + G\r\nArrows + L\r\nFAQ\r\nHow do I host my own multiplayer game?\r\nClick \"host\" in the main menu and choose your player\r\nCopy the invite code and send it to your friend\r\nHow do you block in BasketBros?\r\nYou can block by hitting the spacebar near your opponent.",
        "category": "sports",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/basketbros\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430610405.jpg"
    },
    {
        "id": "basket-random",
        "title": "Basket Random",
        "description": "Basket Random is a wildly fun 2-player arcade sports game with unpredictable physics - hence the name \"random\"! Bounce around and battle for the ball across various crazy basketball courts. Prepare for some seriously chaotic hoops; every dunk catapults you to the next level!\r\n\r\nHow to Play Basket Random\r\nThis two-player basketball game has the same concept as your typical basketball game—shoot the ball into the net—but with a few odd and hilarious twists. There are two teams, and each team consists of two players. Controls guide both your players but be warned that their actions may not coincide with exactly how you expected them to move. Slam dunks are still very possible!\r\n\r\nUse the W key to control player one and the up arrow to control player two. Fight frantically over the basketball, bouncing and spinning in the air, trying to make the shot. Whatever team scores first wins that round. The player to reach 5 wins the game!\r\n\r\nAfter each Basket Random goal, you’re transported to a new place where the physics and attire may differ, shaking up each new round with random changes! Bobble around shooting hoops and have fun in this wacky take on basketball.\r\n\r\nFeatures\r\nStrange bouncy basketball players\r\nLevels and physics change randomly\r\nPlay the game with a friend\r\nFun basketball game with a twist\r\nMore Games Like This\r\nCheck out Soccer Random for a soccer game with the same mechanics. Other popular basketball games in our sports category include Basketball Stars, which adds competitive one-on-one gameplay for those who love the thrill of a good dunk. Other popular titles include BasketBros, a fast-paced, arcade-style action game, and Basketball Stars, a competitive one-on-one gameplay for those who love the thrill of a good dunk.\r\n\r\nRelease Date\r\nApril 2020 (HTML5)\r\nApril 2020 (Android)\r\nDeveloper\r\nRHM Interactive made Basket Random.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nJul 04, 2024\r\n\r\nControls\r\nPress W or up arrow key.\r\n\r\nFAQ\r\nWhat devices can I play Basket Random on?\r\nYou can play this game on the web on most desktop and mobile devices.\r\n\r\nAre there any other games like Basket Random?\r\nYes, you can also find the same wacky physics in Soccer Random.",
        "category": "sports",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/basket-random\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430676810.jpg"
    },
    {
        "id": "mini-golf-club",
        "title": "Mini Golf Club",
        "description": "Mini Golf Club is a realistic 3D mini golf simulator with fun gameplay and hundreds of challenging levels.\r\n\r\nThe game combines beautiful graphics, realistic physics and easy-to-use controls. Mini Golf Club is challenging yet fun golf game for all ages. Your goal is to hit the ball into a series of holes on a course using as few strokes as possible.\r\n\r\nUnique Gamemodes\r\nTournament: Play a large collection of pre-made and user-made courses with 9 holes each. The fewer strikes you have at the end of the course the better.\r\nPractice: Practice each level individually to improve your shooting and aiming skills. Completing the levels are easy but mastering them takes time.\r\nVersus: Play turn-based matches for up to 4 players locally on the same device. Challenge your friends and family.\r\nSplitscreen: Play on the same device with up to 4 players by dividing the available screen space.\r\nOnline multiplayer: Play against your friends in real-time globally.\r\nGrowing collection of courses\r\nThe game features hundreds interactive holes with dynamic parts and moving obstacles.\r\nLevels contain a huge variety of ramps, turns, tunnels, slopes, jumps, sand traps, special boosters and portals.\r\nBoosters like wind zones or jump areas physically accurately interact with your ball.\r\nFeatures\r\nMini Golf Club has high replayability thanks to the advanced physics engine.\r\nYou can play the same level multiple times and you get a different gameplay experience each time.\r\nThe game supports touch, keyboard, mouse and controller inputs.\r\nRelease Date\r\nOctober 2021\r\n\r\nDeveloper\r\nMini Golf Club is developed by Obumo Games.\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\nWindows (link)\r\nLast Updated\r\nMar 18, 2025\r\n\r\nControls\r\nDrag the left mouse button = shoot ball\r\nC = camera mode\r\nArrow keys \/ Mouse = look around\r\nPage up \/ mouse wheel up = zoom in\r\nPage down \/ mouse wheel down = zoom out",
        "category": "sports",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mini-golf-club\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430729464.jpg"
    },
    {
        "id": "qb-legend",
        "title": "QB Legend",
        "description": "QB Legend is a fast-paced sports football game where you take control as the star quarterback. Lead your team through the season and playoffs, making strategic plays to claim the championship title. With full games and opponent simulation, every match challenges your skills and decision-making on the field. New, from the maker of 2 Minute Football -- a whole new way to play, now with full games and opponent simulation!\r\n\r\nHow to Play QB Legend\r\nIt's football time and the game is on with QB Legend. Step onto the field and take control as the quarterback in this fast-paced football showdown! Your job is to pass the ball to a receiver running along the yellow lines. Once they catch it, keep running until you're tackled—the next play starts from that spot.\r\n\r\nUse the keys or mouse to steer, and don’t forget you can spin once per play (press space or double-click) to dodge defenders. A down is a single play, and you have four plays to gain 20 yards—fail, and your opponent takes possession.\r\n\r\nScore a touchdown by catching or running the ball into the end zone for 7 points. Each game consists of four one-minute quarters, and you need to be leading when the clock runs out to claim victory.\r\n\r\nWant to stop the clock? Run out of bounds to buy yourself extra time, especially when every second counts.\r\n\r\nThat’s it, rookie—you're ready for action! The stadium is roaring, the helmets are lined up, and the pressure is on. Can you lead your team to glory?\r\n\r\nMore Games Like This\r\nStay on the field and explore some of our exciting sports titles, including popular soccer games like Soccer Random, a two-player pixel-art soccer game with limited controls but unlimited randomness; A Small World Cup, a fun mini-soccer sports game where you control a rag doll and slam it against the arena to make the ball score a goal. Want to switch from field to court? Try Basketbros, a fast-paced basketball game with online and offline gameplay.\r\n\r\nLast Updated\r\nFeb 03, 2025\r\n\r\nControls\r\nUse the left mouse button and click near the receiver to throw the ball\r\nUse the arrow keys or WASD or drag the mouse to control your player once the ball has been caught\r\nYou may also scramble the Quarterback behind the line of scrimmage by using the arrow keys or WASD or dragging the mouse.\r\nOn touch devices, tap to throw and swipe your finger to control the player's movement\r\nFAQ\r\nWhat is the game called with QB?\r\nQB Legend is a sports football game where you get a chance to gain on-field digital glory.\r\n\r\nWhat does QB stand for?\r\nQB stands for quarterback, related to football",
        "category": "sports",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/qb-legend\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430810677.jpg"
    },
    {
        "id": "tap-tap-shots",
        "title": "Tap-Tap Shots",
        "description": "Tap-Tap Shots is an addictive sports game in which you continuously tap to make your basketball jump. It is an endless basketball practice where you aim to get your ball in the net in one shot, so the goal is to keep playing until you can't anymore, so you may want to cancel all plans for the evening. Perfectly time your taps to score before the clock runs out, and keep going as long as you can!\r\n\r\nHow to Play Tap-Tap Shots\r\nThe gameplay in Tap-Tap Shots is fairly easy. It is a one-button game where each click propels your ball. Depending on your tap, your ball may or may not make the shot.\r\n\r\nThe net moves to a different height and location each time you make the shot. This will test your click skill. The game is, in essence, an endless series of rounds of practice shots. Your best scores are tallied, incentivizing you to be better than you were in the last round.\r\n\r\nThe key to the game is to find the right rhythm when tapping, hence the name tap-tap. How many taps do you need to make every shot?\r\n\r\nTap-Tap Tips\r\nKeep tapping to move the ball slightly until it reaches the net. If you miss, the ball will come back from the other side.\r\n\r\nWhen you score, another net is created in a new location—an endless cycle until you run out of time!\r\n\r\nTime your shots carefully and think fast before you run out of time. If you miss, it’s best to click quickly to get back around and try for another shot, but make sure you don’t overshoot again!\r\n\r\nMore Games Like This\r\nFor more basketball games, have a shot at popular titles in our sports category, such as Basketball Stars, which brings fast-paced, one-on-one action. Another title is Basket Random, which adds a fun and chaotic twist to your basketball experience. For even more hoops excitement, Basketball Legends lets you play as famous players in epic matches.\r\n\r\nIf, instead, you want to try something different and enjoy simple, fun games, check out our hypercasual or one-button games for more. Popular games include Geometry Dash Online, Drift Boss, and Flappy Bird.\r\n\r\nRelease Date\r\nMarch 2018\r\n\r\nDeveloper\r\nTap-Tap Shots is made by Maximiliano Demonte.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\n\r\nControls\r\nLeft-click to dunk.\r\n\r\nFAQ\r\nWhat is the best device to play Tap-Tap Shots on?\r\nSince the game features simple one-click mechanics, it works just as well on mobile and desktop devices.\r\n\r\nHow many lives do you have in Tap-Tap Shots?\r\nYou have unlimited lives, but each shot is timed. If you run out of time without scoring, it's game over.",
        "category": "sports",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/tap-tap-shots\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743430871903.jpg"
    },
    {
        "id": "count-masters-stickman-games",
        "title": "Count Masters: Stickman Games",
        "description": "Count Masters: Stickman Games is a fast-paced running game where you gather a growing army of stickmen to clash against rival crowds. Navigate through obstacles, choose the best paths to multiply your numbers, and lead your team to victory. Battle fierce opponents, defeat the King-stickman, and claim the castle in an action-packed race filled with strategy and excitement!\r\n\r\nControls\r\nMouse = Move the character by moving the mouse left or right. Left-click to select buttons.\r\nKeyboard = Use the left and right arrow keys to move. Press space to select actions.",
        "category": "strategy",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/count-masters-stickman-games\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431000584.jpg"
    },
    {
        "id": "supermarket-simulator-store-manager",
        "title": "Supermarket Simulator: Store Manager",
        "description": "Supermarket Simulator: Store Manager is a dynamic retail experience where you juggle cashier duties and store management. Scan items, process payments, and keep customers happy while managing stock and organizing shelves. As challenges intensify, you’ll grow your store and meet rising demand. Can you handle the rush and build a thriving supermarket empire?\r\n\r\nLast Updated\r\nMar 17, 2025\r\n\r\nControls\r\nWASD to move\r\nMouse to look around\r\nLeft shift to Sprint\r\nSpace to Jump\r\nLeft click to interact with objects\r\nTab to leave\/finish activity\r\nE to open\/close box\r\nR to rotate furniture when moving\r\nR to see reputation\r\nP to pause\r\nZ to skip delivery by watching ads\r\nX to skip delivery by spending energy",
        "category": "strategy",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/supermarket-simulator-cashier-game\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431049828.jpg"
    },
    {
        "id": "bloons-tower-defense-4",
        "title": "Bloons Tower Defense 4",
        "description": "Bloons Tower Defense 4 is a classic tower defense game initially released in Flash. Defend the path by tactically placing various defenses around the map. Upgrade them and unlock more as you get further through the game.\r\n\r\nHow to Play Bloons Tower Defense 4\r\nBloons TD 4 features several tracks with varying levels of difficulty. The easier tracks feature more convenient locations for placing your defenses and tend to be longer. You can also set the difficulty level, reducing the cost of purchases and the amount of levels and increasing your lives.\r\n\r\nThere are 16 unlockable new weapons and defenses the further you get in the level. These items can be upgraded to deal with new threats and take down enemies more efficiently.\r\n\r\nPractice Makes Perfect\r\n\r\nBloons Tower Defense 4 has three difficulty levels to choose from. The beginner level is a good place to solidify your game and work your way up. This game can take time to perfect, so start slowly and build your skills.\r\n\r\nWhat to expect from the Easy level\r\n\r\nYou get 200 lives\r\nThere are 50 rounds\r\nItems are cheaper to purchase\r\nWhat to expect from the Medium level\r\n\r\nYou get 150 lives\r\nThere are 60 rounds\r\nItems are moderately priced to purchase\r\nWhat to expect from the Hard level\r\n\r\nYou get 100 lives\r\nThere are 75 rounds\r\nItems are more expensive to purchase\r\nSandbox Mode\r\n\r\nSandbox is unlocked at rank 26. You get unlimited money and lives. You also get to choose which bloons come and when.\r\n\r\nApopolypse Mode\r\n\r\nApopolypse is unlocked at round 31. You get bloons non-stop until you run out of lives.\r\n\r\nMore Games Like This\r\nThere are many more popular casual games at CrazyGames. Check out Cookie Delivery for a similarly addictive title or World's Hardest Game for something different. You can also play the original Bloons Tower Defense, part of our larger restored Flash games section.\r\n\r\nFeatures\r\nVarious tracks to defend\r\n16 unlockable defense items\r\nUpgradeable defenses\r\nUnlockable game modes\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nControls\r\nUse the left mouse button to place the towers.\r\n\r\nFAQ\r\nHow many rounds are there in Bloons Tower Defense 4?\r\nDepending on the track and degree of difficulty, there are between 50 and 75 rounds in Bloons Tower Defense 4.\r\n\r\nWhat online versions of Bloons Tower can I play?\r\nBloons Tower one to four are available online to play at CrazyGames.\r\n\r\nHow to play Bloons TD 4 for free?\r\nBloons Tower Defense 4 is free to play online at CrazyGames.",
        "category": "strategy",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/bloons-tower-defense-4\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431220222.jpg"
    },
    {
        "id": "snake-shooter-tower-battle",
        "title": "Snake Shooter: Tower Battle",
        "description": "Snake Shooter: Tower Battle is a fast-paced casual defense game where you use precise archery skills to take on a massive creeping dragon. Aim, shoot, and upgrade your bow to fend off relentless attacks. Unlock powerful abilities like fire arrows and multi-shot to strengthen your defenses. With vibrant visuals and nonstop action, every battle tests your strategy and reflexes.\r\n\r\nHow to Play Snake Shooter: Tower Battle\r\nAn enormous snake is slithering toward you, and the only way to stop it is by shooting its segmented body until each part is destroyed. Each segment has a numeric value representing its durability—keep shooting until the number reaches zero to break that section apart.\r\n\r\nTo survive, focus your attacks strategically. Aim for the segment closest to you to prevent the snake from advancing, or target weaker segments with lower numbers to shorten its length and buy yourself more time.\r\n\r\nAs you rack up points, you’ll unlock powerful upgrades:\r\n\r\n🏹 Double Arrows – Fire two shots at once for extra damage.\r\n\r\n🏹 Critical Hits – Boost your chance to deal devastating blows.\r\n\r\n🏹 Explosive Arrows – Blast through segments with high-damage shots.\r\n\r\n🏹 Attack Speed Boost – Fire faster to break down tough segments quicker.\r\n\r\n🏹 Piercing Arrows – Hit multiple segments in one shot.\r\n\r\nThe battle intensifies as the snake grows faster and stronger, even gaining the ability to attack from a distance. Equip battle gear and level up to keep pace with its increasing power.\r\n\r\nIt's important to strategize. Be smart in your approach—strike the front to slow its advance, but take the shot if you see an opportunity to wipe it out entirely! Can you defeat the snake before it reaches you?\r\n\r\nMore Games Like This\r\nExplore the world of casual gaming with our extensive collection of fun and engaging titles. Try fan favorites like Friday Night Funkin', a rhythm-based game where you battle in freestyle music duels or Blob Opera, an interactive musical experience powered by machine learning that lets you create stunning operatic melodies with ease. For a quirky challenge, check out Dumb Ways to Die, where your mission is to keep a hapless character—aptly named “dunce”—safe from a series of unpredictable hazards.\r\n\r\nLast Updated\r\nFeb 25, 2025\r\n\r\nControls\r\nUse mouse or keyboard arrows for aiming.\r\n\r\nFAQ\r\nHow do you win Snake Shooter Tower Battle?\r\nThe key to winning Snake Shooter: Tower Battle is to focus on one portion of the snake, deteriorating its strength and shortening the snake. Keep focused on a balanced amount of weak and strong portions of the snake.\r\n\r\nCan I play Snake Shooter Tower Battle on my phone?\r\nSnake Shooter Tower Battle is available on mobile and can be played for free on most mobile devices.",
        "category": "strategy",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/snake-shooter-cbu\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431265230.jpg"
    },
    {
        "id": "aod-art-of-defense",
        "title": "AOD - Art Of Defense",
        "description": "AOD - Art of Defence is a casual tower defense game set in a post-apocalyptic world. As Commander of the A.O.D squad, you lead the charge against Mr. Ivil's ruthless thugs, determined to find the lost Inola project. With stunning isometric graphics, build your technological kingdoms and thwart the enemy's destructive ambitions. Will you save mankind or succumb to darkness?\r\n\r\nHow to Play AOD - Art of Defence\r\nYour mission in AOD Art of Defense begins with an urgent message from Mr. Ivil—find the blueprints of the fabled Inola Project at all costs—even if it means reducing the city to rubble. Time is of the essence. Meanwhile, Ich Nevel warns of an imminent large-scale assault on your bases. The stakes couldn’t be higher, and it’s up to you to defend humanity’s last hope. You have one goal - to protect your base at all costs.\r\n\r\nDynamic battles ensure that every moment is filled with action. Combining elements of Tower Defense, RPG, and tactical strategy, the game features over 500 sectors for real-time warfare, offering a variety of environments—from small villages to massive abandoned megapolises. You’ll face challenges in exciting new Tower Defense modes like escape, fog, and survival.\r\n\r\nThe aim is strategically deploying siege houses, tanks, and armed trucks to stop enemy forces before they breach your defenses. With over 1,000 tower upgrades, including tanks, miniguns, and air defense systems, your arsenal is as vast as powerful. Along the way, you’ll unlock six unique heroes, each with their own abilities to level up and master. From nuclear bombs to ionic satellite strikes and ballistic barrages, a range of devastating boosters will turn the tide in your favor.\r\n\r\nEvery successful defense wave rewards you with crystals, essential for upgrading your arsenal. The longer you survive, the greater the rewards, but enemies will become stronger with each attack. Hundreds of card upgrades allow you to customize your towers for maximum efficiency, keeping your strategies fresh and adaptable.\r\n\r\nSet in a near-future world devastated by nuclear wars, 70% of the population has been wiped out. The survivors face constant terror from Mr. Ivil, who has united gangs into a brutal army bent on finding the Inola Project blueprints. His forces leave no settlement untouched, robbing and killing indiscriminately. Your task is to stop them and save what remains of the planet.\r\n\r\nIn this endless survival mode, your tactics and preparation are key. Build your defenses wisely, place your siege houses strategically, and upgrade your resources to keep pace with the escalating challenge. Each location demands new strategies and better equipment, pushing your tactical skills to the limit.\r\n\r\nWhether you’re battling through small villages or abandoned megapolises, the world's fate depends on you. With the power of innovative weapons, unique heroes, and an array of upgrades, you hold the key to humanity’s survival. Will you rise to the challenge?\r\n\r\nMore Games Like This\r\nThere are plenty of casual games where you can show off your game skills. Want to stick to defense games? Try our Bloons Tower Defense, a casual game where your mission is to build and fortify your defenses to stop an ever-growing wave of colorful balloons from reaching the end of the track. Another fun game is Doodle Jump, a thrilling game that has you jumping upwards to infinity, grabbing boosts, and avoiding beasts on your way up.\r\n\r\nRelease Date\r\nJuly 2019 (Android)\r\nDecember 2020 (Steam)\r\nMarch 2024\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nSteam\r\nLast Updated\r\nMar 17, 2025\r\n\r\nControls\r\nUse the left mouse button to place a tower\r\nUse the scroll wheel\/pinch the touchpad to zoom in\/out\r\nFAQ\r\nWhat does a katana do in Art of Defense?\r\nThe katana is a rocket launcher that strikes ground targets in the Art of Defence?\r\n\r\nHow do you change the tower for the hero in Art of Defense?\r\nIn the Art of Defense, the hero can move between towers whenever needed. Simply choose a tower and click the hero icon to send them upward.",
        "category": "strategy",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/aod---art-of-defense\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431494401.jpg"
    },
    {
        "id": "castle-craft",
        "title": "Castle Craft",
        "description": "Castle Craft is a mystical adventure puzzle game where you merge resources while looking for Fiona's missing husband, Michael, all the while uncovering plenty of mysteries along the way. Begin in a fog-covered land, using ancient keys to explore hidden realms and trace the path of your lost family through different eras. Discover mysterious lands and piece together an enchanting legacy.\r\n\r\nHow to Play Castle Craft\r\nStep into the wonderous world of Castle Craft, where you play as farmer Fiona, determined on her heartfelt mission to reunite with her husband after a mysterious separation. Your adventure begins in a simple garden, where you combine garden beds and plants to breathe new life into the land—this is the merge element of the game. As you cultivate your wheat fields, you will harvest crops to trade for mystical keys that dispel the fog, revealing hidden territories and secrets waiting to be uncovered.\r\n\r\nAs Fiona restores the land, her journey takes her toward new clues about her husband Michael’s whereabouts, such as his misplaced headphones, and she encounters friendly helpers along the way. Among them is Aiden, a kind woodsman who helps her clear obstacles like a stubborn tree stump. Together, Fiona and Aiden gather timber and merge logs to create essential tools and craft materials, unlocking treasure chests filled with valuable rewards to continue on her quest.\r\n\r\nEvery decision you make shapes Fiona’s path, allowing her to rebuild and expand her world. What begins as a small garden evolves into a thriving medieval kingdom, complete with bustling marketplaces and grand castles. As you progress, the adventure deepens, introducing new lands teeming with hidden treasures, mysterious puzzles, and historical figures who assist in unraveling the mysteries of time and family.\r\n\r\nTo embark on this journey, start by merging three wheat sprouts to cultivate a full wheat crop, then continue merging similar items to develop the garden further. Harvest the wheat to trade for keys that unlock new areas, dispelling the fog and revealing untapped potential. Treasure chests, once opened, offer unique items and heroes to aid Fiona in reclaiming and revitalizing the land. Each merge brings you closer to tracing your family’s footsteps through history and unraveling the secrets of the past.\r\n\r\nMore Games Like This\r\nBrowse our adventure category for more fun titles. Some of our popular games include Battle Arena, a thrilling RPG adventure battle game that seamlessly blends heart-pounding action with strategic gameplay; Dead Land Survival, a survival horror game set in a zombie-infested apocalyptic world you fight for survival with powerful skills you accumulate throughout gameplay; or Immortal Taoists, a captivating idle game where players embark on a journey to immortality in a serene fantasy world.\r\n\r\nLast Updated\r\nFeb 03, 2025\r\n\r\nControls\r\nDrag the left mouse button to merge items.\r\n\r\nFAQ\r\nIs there a game where you can build castles?\r\nCastle Craft is a game where you merge resources while you build a castle, discover mysterious lands, and piece together an enchanting legacy.\r\n\r\nIs Castle Craft free?\r\nYou can play Castle Craft free at CrazyGames.",
        "category": "adventure",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/castle-craft\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431766892.jpg"
    },
    {
        "id": "dead-land-survival",
        "title": "Dead Land: Survival",
        "description": "Dead Land: Survival is a survival horror game set in a zombie-infested apocalyptic world where you fight for survival with powerful skills you accumulate throughout gameplay. Fortify your shelter against relentless undead attacks and scavenge through desolate territories in search of valuable resources. Craft weapons, armor, and essential gear to give yourself an edge in these hostile lands. With danger around every corner, your aim is to keep calm and survive the end of the zombie apocalypse.\r\n\r\nHow to Play Dead Land: Survival\r\nSet out on a treacherous quest through the desolate lands of Dead Land: Survival, where the world has fallen to ruin, and the infected ones lurk around every corner. Once-beautiful landscapes are now wastelands filled with relentless threats, stretching from the eerie remnants of your hometown, Nightstone, to the harsh quarantine zones. Each step into these dangerous territories demands courage as you fight tooth and nail to survive in an unforgiving, apocalyptic world.\r\n\r\nTo stay alive, you must harvest resources from whatever nature has left behind. Gather essential materials from trees and other natural sources to upgrade your hero, repair broken vehicles, and restore key structures like your shelter and workshop. Loot is scattered throughout zombie-infested areas, and every scrap could be crucial to your survival. From metal to wood, each resource strengthens your chance of fighting back against the apocalypse.\r\n\r\nCombat is fierce as you face off against infected enemies with a range of weapons at your disposal. Craft melee weapons and guns, each designed for the brutal, turn-based struggles you’ll encounter. But survival takes more than brute force; you’ll need health packs and food to sustain your strength in prolonged battles. Weapons wear down over time, so be vigilant and repair them as needed, ensuring you're always ready for the next deadly encounter.\r\n\r\nNightstone, your starting refuge in this bleak world, is home to fellow survivors who offer a glimmer of hope. Here, you’ll meet resilient characters who trade with you and assign quests that test your survival skills. You'll earn rewards as you complete these missions and unlock the chance to journey to other survivor outposts. Each quest brings you closer to understanding this dark world and forming alliances in a fight for humanity’s future.\r\n\r\nEngage in turn-based battles with zombies, craft powerful weapons and equipment, earn ratings to compete with clans, and complete a variety of quests in Dead Land: Survival.\r\n\r\nMore Games Like This\r\nDead Land: Survival is a game that can have you hooked for days. However, if you're looking for something new, you can browse more adventure games. Two other games in this category that will keep your attention for just as long include Battle Arena, a thrilling RPG adventure battle game that seamlessly blends heart-pounding action with strategic gameplay; Magic World, an exciting Magical World, where battles with mythical creatures and epic clan wars will keep you on the edge of your seat.\r\n\r\nRelease Date\r\nFebruary 2021\r\n\r\nDeveloper\r\nDead Land: Survival is made by swanrnd.\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nControls\r\nUse the left mouse button to play the game.\r\n\r\nFAQ\r\nWhat is zombie survival game?\r\nThere are plenty of survival games like Dead Land: Survival, a horror game set in a zombie-infested apocalyptic world where you fight just to survive.\r\n\r\nHow do I fix broken items?\r\nBroken items can be repaired in the Workshop building.\r\n\r\nWhat are the lighters, cigarettes, matches, and other items for?\r\nMost of the in-game items are needed to complete settler quests, and some can also be used to upgrade buildings and shelters.",
        "category": "adventure",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/dead-land-survival\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431832095.jpg"
    },
    {
        "id": "hex-empire",
        "title": "Hex Empire",
        "description": "Hex Empire is the action packed turn-based strategy game in which you will try and conquer all by domination of territory. You will start with a single nation, then your goal is to strategize and dominate the map by overruling countries attacking city by city with your armies and more importantly your winning tactics.\r\n\r\nIf you manage to conquer all of the countries and the map you win!. As you go from attack to attack don’t forget get to keep your soldiers happy as morale plays an important role in your success and ability to attack. Can you conquer them all?\r\n\r\nRelease Date\r\nMay 2009\r\nFeatures\r\nSimple graphics\r\nPlay against 3 computer-controlled nations\r\nA massive number of maps to play\r\nA hexagonal object of the movement\r\n3 difficulty options\r\nPlatform\r\nWeb browser\r\nDeveloper\r\nHex Empire is made by Meta Sauce.\r\nControls\r\nUse left-click to play.",
        "category": "adventure",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/hex-empire\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743431942805.jpg"
    },
    {
        "id": "pirates-of-the-caribbean-tow",
        "title": "Pirates of the Caribbean: ToW",
        "description": "Pirates of the Caribbean: Tides of War is a strategic adventure set in the legendary world of pirates. Join Jack Sparrow, Will Turner, and Captain Barbossa on a high-stakes quest for treasure. Command your fleet, engage in fierce battles, and navigate the treacherous seas. Do you have what it takes to become a true pirate legend?\r\n\r\nCommand a ruthless crew, raid ships, and build a fortress to trade or hide from enemies. Join a pirate alliance to hunt mythical creatures or plunder cities and dive into the world of Pirates of the Caribbean. Fair winds, Captain!\r\n\r\nBecome a Legend: Command a crew of notorious pirates, raid enemy ships, and plunder wealthy ports.\r\n\r\nUpgrade Your Fortress: Build and defend your hideout, create a fleet, and enhance ships with looted resources.\r\n\r\nJoin an Alliance: Form or join an alliance to hunt sea monsters, conquer cities, and request help when times are tough.\r\n\r\nJourney with Heroes: Complete story-driven quests, meet iconic characters, and take the helm of fabled ships such as the Black Pearl itself!\r\n\r\nSet sail and become the ruler of the seas!\r\n\r\nControls\r\nUse the Left Mouse Button to interact with objects and navigate the game. Use the Mouse Wheel or Scroll to zoom in and out.",
        "category": "adventure",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/pirates-of-the-caribbean-tow\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432008714.jpg"
    },
    {
        "id": "battle-arena",
        "title": "Battle Arena",
        "description": "Battle Arena is a thrilling RPG adventure battle game that seamlessly blends heart-pounding action with strategic gameplay. Create your team from over 50 unique heroes, each inspired by iconic characters you know and love. Dive into intense real-time PvP battles where your skills and tactics are put to the ultimate test. Join forces with fellow guild players to take on epic quests across breathtaking locations, from ancient ruins to mystical landscapes. As you progress, you can upgrade your heroes and gear, enhancing their abilities and unlocking new powers.\r\n\r\nHow to Play Battle Arena\r\nIn a world overrun by demons, you must choose a region at a time to combat your opponent. Battle Arena fights start off in Serenity Valley, where you can assess your enemy's squad in just a tap. You get to select your heroes for battle. You begin with only three heroes to play with, each with a different weapon and skill. But the amount of heroes you can eventually upgrade to is countless.\r\n\r\nEarly in the game, you will fight Dark Lord, who is less than happy to see you. To win the initial battle and every one afterward, you must use your hero's unique skills—some wield swords while others shoot arrows. Just tap on their avatars at the bottom of the screen to strengthen your attacks.\r\n\r\nIn Battle Arena, your objective is pretty much to build and upgrade your heroes and compete in various challenges, particularly in the arena. The gameplay revolves around gathering resources and gaining experience points to level up. Players can participate in raids to acquire new heroes and enhance their existing ones. The key to success in this game is to strategize by selecting the right battle heroes to maximize team effectiveness.\r\n\r\nAs you engage in battles, you must use different abilities and relics, which provide unique advantages during combat. Upgrading heroes is crucial to improve your performance in battles.\r\n\r\nAlways pay attention to your heroes' health and manage resources wisely, especially during expeditions and arena fights. Using a mix of heroes with complementary skills can lead to successful team combinations and help defeat stronger opponents.\r\n\r\nUltimately, the goal is to push through the ranks in the arena by strategizing hero placements and leveraging their abilities effectively. You can earn significant rewards as you progress, which can be reinvested into your hero roster.\r\n\r\nMore Games Like This\r\nExplore a wide array of adventure games at your fingertips! Check out some popular titles like Firestone Idle RPG, an MMO where you battle against hordes of Undead and Orc enemies; Warlord Fantasy RPG, a fantasy adventure that offers an immersive online experience; Immortal Taoists, where players embark on a quest for immortality; and Magic World, where fierce battles with mythical creatures and epic clan wars will keep you on the edge of your seat!\r\n\r\nRelease Date\r\nDecember 2017 (iOS)\r\nOctober 2022 (HTML5)\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\niOS\r\nLast Updated\r\nMay 23, 2024\r\n\r\nControls\r\nUse the left mouse button to play and interact with all the in-game buttons.\r\n\r\nFAQ\r\nHow do I access Battle Arena?\r\nYou can access the Battle Arena game online at CrazyGames and play on desktop or mobile. You can also access Battle Arena at the App Store.\r\n\r\nCan I choose my heroes in Battle Arena?\r\nYes, you can and should choose your heroes in Battle Arena, but you will need to earn your way to upgrade past the initial heroes offered.",
        "category": "adventure",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/battle-arena\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432077643.jpg"
    },
    {
        "id": "daily-room-escape",
        "title": "Daily Room Escape",
        "description": "Daily Room Escape offers a brain-teasing puzzle adventure game where you are in a unique room filled with intricate riddles and hidden clues. Sharpen your problem-solving skills and unravel mind-bending puzzles to find the key to freedom. Each day brings a new theme, a different set of challenges, and fresh surprises waiting to be discovered. Keep coming back for your daily dose of brain-teasing fun, and see if you have what it takes to outsmart each escape room.\r\n\r\nHow to Play Daily Room Escape\r\nDaily Room Escape is an exciting puzzle game where your objective is to—well, escape! The only way to get out is by solving mini-mysteries throughout the room. Each clue leads to another clue. There are safes in the room that need to be opened, items that can be combined, items that needs inspecitng, locks that require codes—the mysteries are endless, until you crack the code and get out.\r\n\r\nExplore every corner of the room to uncover objects that will aid you on your path to freedom. With each step, keep your eyes peeled for items tucked away in surprising places, waiting to be picked up and used in clever ways. A simple book, an odd key, or a piece of paper could hold the secret to unlocking a tricky door or solving a cryptic puzzle. Look closely, as even the smallest detail could provide the breakthrough you need!\r\n\r\nIn Daily Room Escape, no two days are alike, so don't get too confident on each new gameplay. Every daily challenge brings a fresh room filled with a variety of puzzles designed to test and sharpen your mind. You’ll encounter codes that demand cracking, sequences that need solving, and images that require reassembling. Each puzzle pushes you to think outside the box, using your collected items and wits to decipher the room’s mysteries.\r\n\r\nIf you’re stumped, a hint button is there to help, but the true thrill lies in finding the solution on your own. With persistence and curiosity, every challenge becomes an opportunity to outsmart the game and make your great escape.\r\n\r\nMore Games Like This\r\nDo you enjoy brain-teasing challenges? There are many more adventure games to play on CrazyGames. Two of the most popular titles in this category are Firestone Idle RPG, an Idle fantasy MMO game set in Alandria, and Mirrorland, a turn-based strategy set in a fantastical realm teeming with heroes and monsters. If you're looking for more of a brain teaser, have a go at The Impossible Quiz, an online quiz game where the questions are all difficult to answer and require lateral thinking.\r\n\r\nFeatures\r\nUnique daily escape room game\r\nPick up objects to use around the room\r\nSolve puzzles, crack codes, and more\r\nCome back for a new challenge every day!\r\nRelease Date\r\nJanuary 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nAug 09, 2024\r\n\r\nControls\r\nUse the left mouse button to solve the puzzle.\r\n\r\nFAQ\r\nWhat can I do if I get stuck in Daily Room Escape?\r\nThere is a hint button that you can use if you get really stuck.\r\n\r\nHow difficult is Daily Room Escape?\r\nIt's challenging. However, unlike more tricky escape rooms there is no time limit, and the puzzles are a little more straightforward. This makes it the perfect quick daily challenge to stimulate your mind.\r\n\r\nAre escape rooms healthy?\r\nEscape rooms are a great way to de-stress and focus on finding solutions and problem-solving. If you don't want to try a real-life escape room, you can try an online puzzle experience.",
        "category": "adventure",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/daily-room-escape\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432223517.jpg"
    },
    {
        "id": "stronghold-dude",
        "title": "Stronghold Dude",
        "description": "Stronghold Dude is a strategy game where you build your medieval city and shape your empire's destiny. Face thrilling battles, weave through tales of knights and princesses, and conquer legendary dragons. With survival, tactics, and planning at its core, this adventure invites you to master the art of conquest in a world of magic and epic challenges.\r\n\r\nFeatures\r\n💎 Resources are the basis of prosperity 💎\r\n\r\nEffective management of resources is the key to the success of any civilization. Create an optimal system of collection, storage and distribution of resources.\r\n\r\n🏰 Expand your Kingdom 🏰\r\n\r\nBy building sawmills and weapons workshops, we contribute to the development of our civilization, transforming it from a peaceful settlement into a powerful military power. Gather resources, strengthen your army, build a powerful economy, and defend your borders.\r\n\r\n🐉 Grow your own Battle Dragon! 🐉\r\n\r\nYour dragon will evolve from a hatchling to a fearsome adult. Equip it with armor, sharpen its claws, and unleash it in epic battles.\r\n\r\n⚔️ Fight the Robbers and Defeat the Formidable Bosses ⚔️\r\n\r\nEnjoy awesome raids and epic battles in Stronghold Dude: Fight & Survive. Improve your fighting skills and become a real knight capable of protecting your settlement. Destroy bosses in epic clashes and collect magical rewards. And the main goal is to save the princess from the hands of the evil king.\r\n\r\n👑 Command your own army 👑\r\n\r\nCraft a variety of weapons in the armory, providing the army with a deadly tool for defense. Recruit new warriors and improve their skills in battles. Your army becomes your shield against invaders and a force to reckon with on the battlefield.\r\n\r\nLast Updated\r\nMar 28, 2025\r\n\r\nControls\r\nUse the left mouse button or WASD or arrow keys to play.",
        "category": "adventure",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/stronghold-dude\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432328644.jpg"
    },
    {
        "id": "planet-smash-destruction",
        "title": "Planet Smash Destruction",
        "description": "Planet Smash Destruction is a casual game in which you wield cosmic power to create and destroy planets. You can try out different weapons, design custom planetary systems, and release black holes. With easy-to-use controls, it suits both beginners and seasoned players. Unleash your creativity and discover the wonders of space in this captivating physics simulator.\r\n\r\nHow to Play Planet Smash Destruction\r\nYour goal in Planet Smash Destruction is to destroy planets, essentially for the fun of it. You will journey to various planets and celestial bodies with nothing but courage and weapons to accompany you. Your weapons will help you on your path to destruction, but they also help reshape planets from their original form.\r\n\r\nPlanet Smash Destruction can be categorized as a sandbox game, so you get a significant amount of freedom to explore space, making each gameplay quite unique. Your imagination is the only limit to full space domination.\r\n\r\nThe game starts with a view from space of Earth -- it's just sitting there waiting to be destroyed. Fret not; if all feels overwhelming while destroying your homeland, you can always press reset while repeating the mantra - it's only a game, it's only a game.\r\n\r\nChoose your weapon\r\nThere are several ways to destroy Earth and other planets. On the right side of the screen, select a weapon to destroy your chosen planet. For example, you can choose an alien monster drill to create a donut-like hole in the center of Mars. Or, if the planet is rotating close enough to you, you may want to detonate a bomb. Say goodbye to one or all seven continents with a few consistent laser shots. Want to practice your aim? Send a rocket out to see just how much you can destroy in one go.\r\n\r\nThe more planets you destroy, the more money you earn. Currency will get you upgrades and new planets to explore via a store purchase, allowing you to destroy even more worlds.\r\n\r\nYou can tweak your weapons via settings. You might enlarge your laser beam and change its color, make meteorites hit a wider area, move faster, or expand the blast radius of missiles. You can even unleash dozens of missiles for those peskier planets that are more difficult to destroy.\r\n\r\nMore Games Like This\r\nBrowse our casual game selection to continue the fun. Popular titles include Little Alchemy and Little Alchemy 2, which let you mix and match elements to create new discoveries, while Bloons Tower Defense challenges you to pop balloons with a variety of defenses strategically.\r\n\r\nRelease Date\r\nJanuary 2024\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nLast Updated\r\nSep 06, 2024\r\n\r\nControls\r\nUse the left mouse button to play.\r\n\r\nFAQ\r\nIs Planet Smash Destruction appropriate for 10 year olds?\r\nThe game is appropriate for children aged 9 and older. There is violence in terms of destruction, so parental screening is advised.\r\n\r\nWhat are the secret planets in Planet Smash Destruction?\r\nPlanet Smash Destruction has 15 secret planets, including Donut Earth, Cube Earth, Flat Earth, and Snowman. Ghost World, Pumpkin, Gingerbread Man, Block World, Sun, Cube Mars, Ghost Donut, Snow Globe, Water World, Ceres, and Waterworld.\r\n\r\nWhat is Planet Smash Destruction available on?\r\nYou can play Planet Smash Destruction online at CrazyGames. It is compatible with mobile and desktop. Planet Smash Destruction can also be downloaded from the App Store or Andriod.",
        "category": "casual",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/solar-smash\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432386784.jpg"
    },
    {
        "id": "slice-master",
        "title": "Slice Master",
        "description": "Slice Master is a casual one-person game whose goal is to slice everything in sight, well, almost everything. This one-button game is driven by precision, timing, and discernment to rack up a high score. Flying knives are generally a no-no, but in this game, they are the only way to progress to new blades and skins.\r\n\r\nHow to Play Slice Master\r\nSlice Master is a one-button game controlled by the space pad on your keyboard or the left click on your mouse. All the control lies in this one simple movement. The game has an ASMR quality, and the consistent slicing is oddly soothing in sound.\r\n\r\nThe aim is simple: slice everything in sight: fruit, shapes, walls, furniture, and more. You can slice most things, but don’t add the white wall to your target list—it’s just a holding material for your knife.\r\n\r\nYou will get to shop along the way, using the coins accumulated to purchase objects like sharper blades, swords, mace, and more.\r\n\r\nTips\r\nStay away from the pink spiked metal shapes. They are too strong for your knife and will take you straight back to the beginning of the round.\r\nHit the correct numeric target at the end of each level to multiply your points by the target number and boost your score.\r\nRelease Date\r\nApril 2024\r\n\r\nPlatform\r\n\r\nWeb browser (desktop and mobile)\r\n\r\nMore Games Like This\r\nIf casual games are your style, you can find a slew of them in our casual game category. Go for a classic like Bubble Shooter Classic or a head-scratching word teaser like Text Twist, and if you really want to be adventurous, try to outwit Google in Google Feud or other players in Free GeoGuessr. Light play and a hard challenge make for the perfect afternoon break.\r\n\r\nLast Updated\r\nJul 31, 2024\r\n\r\nControls\r\nUse the left mouse button or space to flip your knife into action.\r\n\r\nFAQ\r\nHow can I earn more points in Slice Masters?\r\nWhen you reach the end of the level, make sure you hit the numbered targets to multiply your points. The higher the number, the more points you will receive, so aim high.\r\n\r\nCan I cut the white pillar in Slice Masters?\r\nNo, the white pillar can’t be cut, but you can attach it and use it as a safety net to prevent it from hitting the ground.\r\n\r\nCan I go backwards in Slice Masters?\r\nNo, you can only go forward in Slice Masters.\r\n\r\nHow many knives can I unlock in Slice Masters?\r\nYou can unlock 9 knives in Slice Masters so keep those points coming.",
        "category": "casual",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/slice-master\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432436866.jpg"
    },
    {
        "id": "man-runner-2048",
        "title": "Man Runner 2048",
        "description": "Man Runner 2048 is a fun casual game where you run and merge men to reach 2048. Your goal is to get the highest score on each level so you can shoot the giant monsters with the most power.\r\n\r\nIf you enjoyed this addictive casual game, check out some similar popular titles like Square Bird and Drift Boss. You can also browse more of our 2048 games!\r\n\r\nHow to Play\r\nAvoid obstacles and collect diamonds along the way.\r\nBuy accessories to make your character more attractive.\r\nUse the cannonballs at the end of each run to blow up monsters and conquer all the islands!\r\nRelease Date\r\nNovember 2022 (Android)\r\nAugust 2023 (WebGL)\r\nDeveloper\r\nGMR Bros. made this game.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\nLast Updated\r\nMar 11, 2025\r\n\r\nControls\r\nUse the left mouse button or AD or left-right arrow keys to move to the left and right.\r\nUse the left mouse button to aim the monster.",
        "category": "casual",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/man-runner-2048\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432496539.jpg"
    },
    {
        "id": "playground-man-ragdoll-show",
        "title": "Playground Man! Ragdoll Show!",
        "description": "Playground Man! Ragdoll Show! is a casual action 3D game with ragdoll physics where you enter a world of destruction. Get ready to tear apart a wooden stickman! Immerse yourself in a physics-based playground, smash obstacles, and relax while solving engaging puzzles.\r\n\r\nHow to Play Ragdoll Break\r\nRagdoll Break is a wild physics-based adventure where chaos is pretty much the goal. Press and hold objects to move them, then release to launch them into action. Your mission? Inflict maximum damage on the stickman using anything and everything at your disposal.\r\n\r\nDrop a car on its head, hurl a ball straight at it, or send it tumbling down a flight of stairs. Some levels feature multiple stickmen—double the targets, double the strategy!\r\n\r\nPosition your ragdoll in the path of speeding traffic, beneath a falling barbell, or against an unforgiving wall. Every action triggers a reaction, so experiment with different ways to unleash destruction.\r\n\r\nWith realistic ragdoll physics, unpredictable puzzles, and endless ways to cause mayhem, Ragdoll Break is the ultimate test of creativity and problem-solving skills. Your challenge is to find the most devastating solutions to your ragdoll's demise.\r\n\r\nFeatures\r\nExciting levels with creative tasks that require unique solutions\r\nHilarious ragdoll physics and interactive environments\r\nCompete in global leaderboards and challenge other players\r\nPlay online from any device and enjoy destruction anytime on your smartphone or PC\r\nMore Games Like This\r\nFor fans of casual games, have a go at Dumb Ways to Die, where your goal is to protect a hilariously clumsy character, labeled as a \"dunce,\" from a series of unpredictable challenges. Or enjoy Pop It, a satisfying arcade game where you pop bubbles in fun and unique character shapes! If you are looking for more action games, you may also like Bloons Tower Defense, a casual game where your mission is to build and fortify your defenses to stop an ever-growing wave of colorful balloons from reaching the end of the track.\r\n\r\nLast Updated\r\nMar 13, 2025\r\n\r\nControls\r\nDrag the left mouse button to move the object.\r\n\r\nFAQ\r\nWhat does the term ragdoll mean in gaming?\r\nIn gaming, ragdoll refers to a physics simulation technique that creates realistic movements.\r\n\r\nIs Ragdoll Break free to play?\r\nYou can play Ragdoll Break for free online at CrazyGames.",
        "category": "casual",
        "rating": "4.4",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/ragdoll-break\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432549064.jpg"
    },
    {
        "id": "worldguessr-free-geoguessr",
        "title": "WorldGuessr Free GeoGuessr",
        "description": "Worldguessr is a casual quiz game, a free alternative to Geoguessr, perfect for testing and expanding your geography skills through immersive Street View exploration. Each round, you will find yourself dropped into random locations around the globe, with only environmental clues to guide you in pinpointing your exact whereabouts. From cityscapes to rural roads, your surroundings become the puzzle pieces you need to analyze, turning each game into a thrilling geographical investigation.\r\n\r\nHow to Play Worldguessr\r\nIn Worldguessr, each game starts by placing you somewhere on Google Maps, and if you can’t immediately guess where you are, which is likely the majority of the time as you often start on obscure, long, and winding roads, you can move around to gather valuable clues. Search for nearby landmarks, coastlines, street signs, architectural styles, and other geographical features that might give away your location. Anything with a bit of language, like signs or billboards, can be especially useful, helping you narrow down your guess to a specific country or region.\r\n\r\nWorldguessr exploration goes beyond simple gameplay, offering an engaging way to enrich your geographic knowledge. Choose from hundreds of community-created maps tailored to different regions and themes, allowing you to travel from bustling metropolises to remote wildernesses. With unlimited rounds and a variety of challenges, you can play at your own pace or jump into multiplayer modes, where you’ll compete with friends or players worldwide.\r\n\r\nFor those moments when you feel completely stumped, Worldguessr offers a helpful hint feature. This hint won’t give away your exact location, but it will nudge you in the right direction by identifying the general part of the world—such as the continent—where you are. From there, the challenge is yours to explore, observe, and deduce the country, city, and even the town where you’ve been dropped, relying on your own skills to make the final call.\r\n\r\nOnce you make your guess, Worldguessr reveals just how close—or far—you were from the actual location, helping you refine your skills over time. This unique blend of learning and adventure makes Worldguessr perfect for geography enthusiasts, travelers at heart, or anyone who loves a good challenge.\r\n\r\nMore Games Like This\r\nIf you like this game, you will want to browse our casual games for even more of the same. Popular titles include Google Feud, a quiz game where you guess a portion of Google queries; Tile Guru, a tile-matching game designed to train your brain and promote relaxation; and Flappy Bird, a side-scrolling game in which you click to avoid obstacles.\r\n\r\nControls\r\nUse the mouse to play the game.\r\n\r\nFAQ\r\nCan I play Worldguessr for free?\r\nWorldguessr is free to play at CrazyGames.\r\n\r\nHow do you find where you are in Worldguessr?\r\nThe key to finding where you are in Worldguessr is exploring where you are and looking for cultural clues.",
        "category": "casual",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/worldguessr\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432596629.jpg"
    },
    {
        "id": "bridge-race",
        "title": "Bridge Race",
        "description": "Bridge Race is a competitive casual collect building game where you gather blocks to construct your bridge while outsmarting rivals. Stay alert as other players may try to steal your progress, adding an exciting twist to the challenge. Strategize and race to complete your bridge first in this thrilling test of skill and speed!\r\n\r\nHow to Play Bridge Race\r\nBridge Race is an oddly satisfying game where you aim to collect as many blocks of your color as possible and carry them across the board to build a bridge. The objective is to create a path that leads you to the next collection area and, ultimately, to the finish line. Victory is sweet, but the challenge continues as each round gets more difficult.\r\n\r\nThe game is designed to be both simple and rewarding, with delicate sounds that create a satisfying atmosphere. You'll encounter obstacles like slides and elevators, which add a fun element as you navigate through the level, taking you closer to the next challenge.\r\n\r\nBut you’re not alone in this race. Other players are also collecting blocks to build their own bridges, and they’re more than happy to challenge you along the way. If you’re not careful, your opponents can sabotage your progress by building over your bridge, undoing all the hard work you’ve done. And if you run out of blocks and need to return to collect more, be prepared for your opponents to steal your blocks, changing their color to match yours and forcing you to start the process over again. You’ll also have to watch out for being knocked down by other players, which causes you to lose all the blocks on your back.\r\n\r\nThroughout the game, you’ll encounter rewards scattered across the map. Green rewards multiply the number of blocks you carry, giving you an advantage, while red ones will diminish your collection, so it’s important to avoid them at all costs. Stay vigilant, collect wisely, and you’ll be on your way to victory!\r\n\r\nMore Games Like This\r\nUnwind and keep the fun going with some of our most popular casual games, including another music category title called Blob Opera, a game that uses a machine learning model trained on authentic voices to make it easy for anyone to create amazing operatic music. Other fun titles worth a try include Happy Wheels, a side-scrolling ragdoll physics game, and Tile Guru, a casual puzzle tile-matching game that combines mental sharpness with relaxation.\r\n\r\nControls\r\nUse WASD \/ Arrow keys \/ Joystick to move.\r\n\r\nFAQ\r\nWhat is the Bridge Race game about?\r\nBridge Race is a fast-paced game where you collect blocks, build a bridge, and outsmart rivals to finish first!\r\n\r\nIs Bridge Race an online game?\r\nYou can play Bridge Race online for free at CrazyGames.\r\n\r\nHow many levels are there in the Bridge Race?\r\nThere are 1000 levels in Bridge Race.",
        "category": "casual",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/bridge-race\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743432687501.jpg"
    }
]