[
    {
        "id": "traffic-rider",
        "title": "Traffic Rider",
        "description": "Traffic Rider is a first-person endless racing game that puts you on a motorbike for an exhilarating ride. With a full career mode, lifelike bike sounds, and detailed graphics, it redefines arcade racing. Speed through highways, overtake traffic, and upgrade your rides to conquer challenging missions. Embrace the thrill and master the art of smooth racing.\r\n\r\nFeatures\r\nFirst person camera view\r\n34 motorbikes to choose from\r\nReal motor sounds recorded from real bikes\r\nDetailed environments with day and night variations\r\nCareer mode with 90+ missions\r\nOnline leaderboards and 30+ achievements\r\nSupport for 19 languages\r\nLast Updated\r\nMar 27, 2025\r\n\r\nControls\r\nUp arrow = throttle\r\nDown arrow = brake\r\nLeft arrow = left\r\nRight arrow = right\r\nHorn = H\r\nWheelie = Y\r\nLook left = T\r\nLook right = U\r\nGear up = R\r\nGear down = F\r\nPause = P or F1\r\nYou can always change controls in settings menu.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/traffic-rider-vvq\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743257697685.jpg"
    },
    {
        "id": "sky-riders",
        "title": "Sky Riders",
        "description": "Sky Riders is a high-speed casual vehicle driving game. Put your driving skills to the test as you complete several challenging tracks. Stay focused and avoid falling off! Whether you're behind the wheel of a car or riding a motorcycle, prepare for an adrenaline-fueled adventure and unforgettable racing moments. Get ready to conquer difficult tests and feel the excitement of Sky Riders!\r\n\r\nThis game is similar to other casual car games, but has a more realistic twist. For something more arcade-style, check out Super Hero Driving School and Ramp Car Jumping!\r\n\r\nFeatures\r\nDrive bikes and cars through the sky\r\n30 challenging tracks to complete\r\nRealistic physics make the game tricky\r\nSee what awesome stunts you can do!\r\nRelease Date\r\nJune 2023\r\n\r\nDeveloper\r\nSky Riders was developed by Stand By Games.\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nLast Updated\r\nDec 21, 2023\r\n\r\nControls\r\nW or up arrow key = forward\r\nS or down arrow key = back\r\nA or left arrow key = move left\r\nD or right arrow key = move right\r\nSpace = handbrake\r\nLeft mouse button = interact ingame UI",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/sky-riders-buk\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743260555299.jpg"
    },
    {
        "id": "mahjongg-solitaire",
        "title": "Mahjongg Solitaire",
        "description": "Mahjongg Solitaire is an online mahjong puzzle board game featuring traditional rules and modern visuals. There are no shuffles, and the game is timed, but the game's pace is relaxed.\r\n\r\nHow to Play Mahjongg Solitaire\r\nSpot the patterns\r\n\r\nMahjong is a tricky puzzle game. There are so many tiles, many of which look the same but feature slight differences. Along with the need to spot these patterns, you can’t move any pieces with both sides blocked. The left or right side needs to be accessible, at least.\r\n\r\nUse hints when you’re stuck\r\n\r\nMahjongg Solitaire features hints if you get stuck, but unlike some other mahjong games, it does not have a shuffle feature. The games are also timed, meaning there is some urgency to how many tiles you can match.\r\n\r\nWhen the game ends, you’ll get a score for the tiles you matched and a bonus for how far you got in the game before your time ran out.\r\n\r\nTile groups in Mahjongg Solitaire\r\nMahjongg Solitaire features 144 tiles divided primarily into three suits. The primary suits are:\r\n\r\nDots - feature circles\r\nBamboo - feature lines\r\nCharacters - feature Chinese characters\r\nIn Mahjongg Solitaire, you’ll also notice special tiles that can be matched even without the same image. These are highlighted in blue or green.\r\n\r\nMore Games Like This\r\nMahjong Solitaire is an excellent choice for a beginner or regular Mahjong enthusiast. However, there are many other titles in our collection of Mahjong games such as Mahjong. Other puzzle games you may like include board games such as Yahtzee Online, Rummikub, and Ludo.\r\n\r\nRelease Date\r\nOctober 2016\r\n\r\nPlatform\r\nWeb browser (desktop and mobile). We also have the Android version.\r\n\r\nLast Updated\r\nAug 03, 2022\r\n\r\nControls\r\nUse the left mouse button to interact.\r\n\r\nFAQ\r\nIs it spelled mahjong or mahjongg?\r\nBoth words are correct and are used to describe the same game.\r\nIs Mahjongg Solitaire a difficult game?\r\nMahjong is generally a tricky game, but this is probably a medium-difficulty mahjong game compared with others. There are no shuffles, but you have 10 minutes and unlimited hints which balances the game nicely.\r\nIs Mahjong Solitaire a free game?\r\nYes, you can play Mahjong Solitaire online for free at CrazyGames.\r\n\r\nIs Mahjong good for the brain?\r\nPuzzle games are often cited as keeping the mind sharp and maintaining brain health.",
        "category": "puzzle",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mahjongg-solitaire\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743264862795.jpg"
    },
    {
        "id": "farm-merge-valley",
        "title": "Farm Merge Valley",
        "description": "Farm Merge Valley is a puzzle business farming game where you merge various animals and objects to upgrade them. Grow crops and add animals to your farm while expanding to exciting new lands. Discover the peaceful farm life you always dreamed of while reaping the rewards from various challenges.\r\n\r\nHow to Play Farm Merge Valley\r\nMerge to grow your farm\r\n\r\nBuild the perfect farm life for your friendly neighbors and animals. Start by merging crops to reach new types of things to grow. You can create various animals, crops, and materials to produce goods and repair buildings.\r\n\r\nLevel up your experience\r\n\r\nKeep merging to gain experience points and increase your level. You will unlock new items and rewards that help you progress in the game when you level up. Leveling up brings more game features to enjoy and areas that help expand your farm.\r\n\r\nFulfil orders to earn money\r\n\r\nWhen your animals produce output, you can use the product to manufacture goods to sell for money. You can use your currency to purchase new areas of land and grow your farm to new heights. You'll find new buildings to renovate and expand your production to new heights that deliver greater monetary rewards.\r\n\r\nMore Games Like This\r\nYou might want to play something new when you've finished Farm Merge Valley. Browse our merge games for more free and fun gaming experiences. Little Alchemy and Little Alchemy 2 are worth a try. Other puzzle games you may enjoy are Bolts and Nuts and Sand Tetris. You may also want to have a look at our wide range of farming games.\r\n\r\nFeatures\r\nMerge crops and animals to create more valuable items\r\nComplete various tasks and reap the rewards from your labor\r\nExpand to new lands as you progress\r\nBuild a beautiful self-sustaining farm life\r\nRelease Date\r\nNovember 2022\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nMar 17, 2025\r\n\r\nControls\r\nPress and hold the left mouse button to pick up and move objects on the grid.\r\n\r\nFAQ\r\nHow can I make money more quickly in Farm Merge Valley?\r\nThe best way is to save your coins so you can merge them. Try to reach the golden star coin to get a big payout.\r\n\r\nWhat are the toolboxes for in Farm Merge Valley?\r\nThey provide one component required to renovate a new area of production.\r\n\r\nHow do you play Farm Merge?\r\nFarm Merge tasks you with creating the perfect farm life for your friendly neighbors and animals. Merge crops to create a bustling farm of animals, materials and plenty of food!",
        "category": "puzzle",
        "rating": "4.4",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/farm-merge-valley\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743265320769.jpg"
    },
    {
        "id": "words-of-wonders",
        "title": "Words of Wonders",
        "description": "Words of Wonders is a crossword puzzle where you connect letters to reveal hidden words. Test your vocabulary and find all the words to progress and reach more challenging levels. Will you become a master wordsmith in this delightful word game?\r\n\r\nHow to Play Words of Wonders\r\nWords of Wonders is an engaging word puzzle game that combines the excitement of crossword puzzles with the thrill of word search. Players form words by connecting letters in a grid, unlocking hidden words,, and progressing through levels.\r\n\r\nYou'll see a grid of random letters when you start the game. Each grid represents a level; your task is to find words by connecting adjacent letters. You can swipe your finger over the letters in any direction—horizontally, vertically, or diagonally—to form words. Longer words and more complex combinations may unlock bonus rewards, so watch for opportunities to maximize your word choices.\r\n\r\nConnect the letters to form a word. It will be revealed if the word you formed is on the crossword grid. Not all words will be on the grid, so use the letters you have already discovered to ensure you create words that will fit the puzzle!\r\n\r\nCompleting the grid allows you to unlock the next level, which gets progressively more challenging. The difficulty increases with more letters and words to find, so keep your brain engaged as you move through the game.\r\n\r\nSome examples include finding the words “WON,” “OWN,” “NOW,” or “TOP,” “POT,” or “OPT” from a set of three letters. Or a mixture of three and four-letter words to form “WALL,” \"ALL,” and “LAW.”\r\n\r\nIf you find yourself stuck, there are hints and boosters available to help you out. These tools can reveal letters or help you find the next word, though they're limited, so use them wisely. There are also rewards for completing levels or discovering difficult words, such as coins or additional hints, which can help you advance further.\r\n\r\nProgress through the levels and collect unique background images with each new milestone. The levels get more difficult by introducing longer words and more letters, increasing the chances of getting it wrong and challenging your vocabulary skills!\r\n\r\nSome levels feature specific themes, like landmarks or animals, where the words you form are related to that theme. As you progress, you’ll unlock different \"worlds\" or locations, each with unique challenges and puzzles. You also get fun bits of info throughout, like learning that The Great Pyramid of Giza is the oldest of the Seven Wonders of the Ancient World.\r\n\r\nThe goal is to find all the words in the grid before you run out of moves or time. Each level has a set number of words to complete in order to progress to the next stage. You may also encounter bonus rounds or challenges that offer extra rewards when completed.\r\n\r\nAs you move through levels, you'll earn points, coins, and other rewards, which will help you advance in the game. Some versions of the game also let you compete against friends or other players, adding a competitive element to the experience.\r\n\r\nWith its relaxing pace and engaging gameplay, Words of Wonders is a fun way to challenge your mind and expand your vocabulary while enjoying an immersive puzzle-solving experience.\r\n\r\nEnjoy a range of exciting and challenging word puzzles in Words of Wonders. The game features an easy starting point to suit players of all ages and experience levels. See how good you are at finding all the words and become a master wordsmith!\r\n\r\nGame Tips\r\n\r\nUse the letters you have already discovered as a clue to find the word\r\nUse the hammer icon to reveal a letter of your choice\r\nClick on the hints button to reveal a random letter\r\nEarn gems to buy hints and reveal letters\r\nMore Games Like This\r\nOnce you’ve reached your linguistic limits in Words of Wonders, check out more of our curated word games. There are many fun word games for all knowledge levels. Two popular choices to play next are Word Wipe, a word search game with a twist where you use letters from all around and in any direction; Word Scramble, a classic word game where you unscramble letters to find words, or Word Search, a simple yet classic game offered in different languages.\r\n\r\nRelease Date\r\nApril 2018 (Android and iOS)\r\nMay 2023 (HTML5)\r\nDeveloper\r\nWords of Wonders was made by Famobi.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 19, 2023\r\n\r\nControls\r\nDrag the left mouse button on the letters to assemble a word.\r\n\r\nFAQ\r\nHow do you earn sapphires in Words of Wonders?\r\nYou can earn gems by completing levels and taking part in the daily spin to win.\r\n\r\nIs Words of Wonders a difficult game?\r\nIt's not too tricky to play, but gets harder as the levels progress. It's an excellent game for all ages.",
        "category": "puzzle",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/words-of-wonders\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743266067856.jpg"
    },
    {
        "id": "smash-karts",
        "title": "Smash Karts",
        "description": "Smash Karts is a 3D multiplayer IO kart battle game. Drive your go-kart, pick up weapons, and blow up other karts to win! Keep playing to level up and unlock new characters and prizes.\r\n\r\nHow to Play Smash Karts\r\nBattle and earn XP\r\nFace off with other players in the arena for 3 or more minutes of kart-smashing mayhem. The game has several maps to explore, and it is actively updated with more. Each public game you play will give you XP, which you can then use to level up. \r\n\r\nLeveling up will reward you with coins, hats, wheels, and character tokens. You can use character tokens in the prize machine to unlock new characters with varying rarity levels.\r\n\r\nPick up weapons\r\nDrive over the boxes containing question marks to pick up random weapons and power-ups. You’ll find anything from invincibility to missiles, machine guns, and mines to use against your opponents. Get in your kart and cause some chaos!\r\n\r\nCustomize your kart!\r\nChoose between a selection of wacky little characters and karts. You can customize your kart and characters in the customize menu. There, you’ll find a selection of karts, characters, hats, and holiday items! Use your coins, character tokens, and gems to buy various in-game items.\r\n\r\nPlay in events\r\nVarious seasonal events occur throughout the year, so make sure to come back and play Smash Karts at special times of year for new content. New maps are available around Halloween, Christmas, and other festive occasions, and you can reap unique rewards.\r\n\r\nMore Games Like This\r\nKart games like SmashKarts.io combine two awesome game modes together: deathmatch arena and kart driving. Kart Wars is an intensely chaotic multiplayer kart game inspired by Mario Kart. Choose from a range of characters and conquer the arena. More kart games can be found here. Other popular online IO games include 1v1.lol, Agaro.io, and Ducklings!\r\n\r\nFeatures\r\nAction-packed multiplayer kart battles\r\nLevel up, earn coins, and save your stats\r\nSeveral weapons, from miniguns to bombs!\r\nCustomizable karts and characters\r\nRelease Date\r\nMarch 2020\r\n\r\nUpdates\r\nJune 2020: A new level, The Gravel Pit\r\nDeveloper\r\nSmashKarts.io is developed by Tall Team. They also developed the game Investor Island and BlastAR Pro, an augmented reality arcade game.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\niOS\r\nAndroid\r\nLast Updated\r\nMar 21, 2025\r\n\r\nControls\r\nWASD or arrow keys to drive\r\nSpace to fire weapons\r\nFAQ\r\nWho made Smash Karts?\r\nSmash Karts was made by Tall Team.\r\nHow do you get coins in Smash Karts?\r\nWhen you level up you will earn coins and other in-game items.\r\nHow to shoot in Smash Karts?\r\nUse the space bar to shoot in Smash Karts.\r\n\r\nIs Smash Kart addictive?\r\nWith over 1 million downloads on IOS and the App Store, Smash Karts has plenty of addictive gameplay qualities, gathering even more players. This game requires a mixture of strategy and skill, which makes for the perfect competitive experience.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/smash-karts\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315018354.jpg"
    },
    {
        "id": "sandbox-city",
        "title": "Sandbox City",
        "description": "Sandbox City - Cars, Zombies, Ragdolls! is a zombie game where you can explore freely and drive around the city, but, be careful of the zombie's infection! Find the zombies and kill them before the infection spreads around and the city.\r\n\r\nRelease Date\r\nNovember 2020 (Android)\r\nJuly 2021 (iOS)\r\nDecember 2021 (WebGL)\r\nDeveloper\r\nYilmaz Kiymaz made Sandbox City - Cars, Zombies, Ragdolls!.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\niOS\r\nLast Updated\r\nMar 27, 2025\r\n\r\nControls\r\nWASD or arrow keys = move\r\nLeft-click = attack. Hold to shoot\r\nHold shift = run\r\nSpace = jump when on foot, handbrake when in the car\r\nE = enter \/ exit car, buy items\r\nR = switch between weapons\r\nT = enter and exit Slo-Mo mode\r\nL = lock \/ unlock mouse cursor\r\nC = change camera perspective\r\nEsc = quit",
        "category": "racing",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/sandbox-city---cars-zombies-ragdolls\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315600688.jpg"
    },
    {
        "id": "polytrack",
        "title": "PolyTrack",
        "description": "PolyTrack is a fast-paced, low-poly driving game featuring thrilling loops, jumps, and high-speed action where every millisecond counts. Inspired by TrackMania, it challenges you to race against the clock, constantly striving to improve your time on various tracks built by you and the Polytrack community! It doesn't get any more hands-on than that.\r\n\r\nHow to Play Polytrack\r\nPolytrack is a classic car racing game with a slight twist. You race a car you customize and on a track you've designed yourself. This means you not only have to think about beating your own record when it comes to time, but you also need to master the craft of building for speed and precision.\r\n\r\nStart by creating your track using the game’s design tools or choosing from pre-made tracks. Customize the track with various obstacles, ramps, and curves to suit your preferences. Don't know exactly what track to build? Get help from the Polytrack community. There are plenty of forums that share design codes and customizing tips.\r\n\r\nWith a built-in level editor, you can unleash your creativity by designing custom tracks. You can also export and share these tracks with others for endless racing (and design) fun.\r\n\r\nThe game will require time and patience, as you don't just go into it like other driving games, with your foot on the pedal and ready to rev and drift. Initially, the easiest tracks to build are straight lines, but as soon as you get the hang of it, you will have a track jumping over mountains, sending your car and score soaring.\r\n\r\nA series of premade tracks is available for those who want to begin practicing and getting a feel for other designs.\r\n\r\nMore Games Like This\r\nOnce you've mastered building your tracks, you can enjoy these other thrilling driving games: Moto X3M, where you experience high-octane motocross action with challenging courses, stunts, and exciting levels, or Drift Hunters where you test your drifting skills in this game that features a variety of cars and tracks designed for perfecting those thrilling drifts.\r\n\r\nRelease Date\r\nMarch 2023\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nNov 04, 2024\r\n\r\nControls\r\nDriving Controls\r\nWASD \/ arrow keys = drive\r\nEnter \/ R = restart\r\nEditor Controls\r\nLeft-click = build\r\nRight-click + move = move camera view\r\nMiddle mouse-click + move = rotate camera view\r\nMouse-scroll = zoom in \/ out\r\nShift + mouse-scroll \/ ZC = height up \/ down\r\nQE = rotate camera view to the left \/ right\r\nR \/ Space = rotate item\r\nX = delete item\r\nT = test drive\r\nFAQ\r\nHow to play Polytrack?\r\nIn Polytrack, you race a car you customize on a track you've designed yourself. This means you have to think about beating your record and master the craft of building for speed and precision.\r\n\r\nCan I share my track designs with other Polytrack players?\r\nPolytrack has an active and robust online community where you can share design codes and customizing tips.",
        "category": "racing",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/polytrack\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315719059.jpg"
    },
    {
        "id": "parking-jam",
        "title": "Parking Jam",
        "description": "Parking Jam is a challenging puzzle game where you untangle a crowded parking lot one car at a time. Use your logic and problem-solving skills to move vehicles in the correct order, clearing the way without causing chaos. With each level, tackle increasingly complex puzzles filled with more cars and tricky obstacles.\r\n\r\nHow to Play Parking Jam\r\nEveryone's been stuck in a parking jam, but the real challenge is figuring out how to escape!\r\n\r\nThis is a satisfying puzzle game where you click and drag cars to clear them from a crowded parking lot and onto the street. As you progress through the rounds, the difficulty increases, with road barriers and tighter spaces making it harder to maneuver the vehicles. Careful planning is key to getting all the cars out.\r\n\r\nCars can be moved in reverse, allowing for different strategies to clear the jam. Each puzzle comes with a limited number of moves, so you’ll need to think ahead and use them wisely. Your score also reflects how many players have successfully solved the same parking jam, giving you a sense of the challenge level.\r\n\r\nSome levels, like Level 11, are especially tricky due to the sheer number of cars blocking the way. Can you navigate through the toughest jams and free up the lot?\r\n\r\nMore Games Like This\r\nBuckle up and keep your eyes on the road. You can continue on your journey with some of our most popular driving games like Drift Hunters, a 3D game that lets you experience the art of drifting with an impressive range of tuned-up cars and dynamic tracks; Mr Racer, where you can zoom through busy streets in various locations; or Moto X3M, a driving bike game that takes dirt bike racing to the next level.\r\n\r\nControls\r\nClick and slightly drag the cars in the direction you want them to get out of the parking lot.\r\n\r\nFAQ\r\nHow do you play the car jam game?\r\nParking Jam is a puzzle game where you click and drag cars to clear them from a crowded parking lot, getting the cars out of gridlock and onto the streets.\r\n\r\nIs Parking Jam a real game?\r\nParking Jam is indeed a real game and can be played online for free at CrazyGames.",
        "category": "racing",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/parking-jam-dqq\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315804291.jpg"
    },
    {
        "id": "night-city-racing",
        "title": "Night City Racing",
        "description": "Night City Racing is a car-driving game with fantastic races, epic stunts, and awesome supercars. Gear up for heart-pounding races and wild challenges that will test your skills! Rack up cash as you speed through the tracks and use it to upgrade to flashy, jaw-dropping cars. Whether you’re showing off your racing skills in epic two-player mode or going for solo glory, the trophy is yours for the taking. So buckle up, race hard, and let everyone know you’re the ultimate speed demon!\r\n\r\nHow to Play Night City Racing\r\nRace against the competition\r\n\r\nGet in the driver’s seat and tackle some of the world’s best sports cars head-on. As you progress, there are 16 racing challenges to complete that increase in difficulty. Take on anything from the tricky corners of city streets to the open landscapes of an airfield in these thrilling races.\r\n\r\nComplete various challenges\r\n\r\nEarn some extra cash by completing five fun challenges. You’ll race against an airplane and the clock to the finish line on a range of obstacle-laced tracks. If you’re successful, the money flows into your account.\r\n\r\nGo for a spin in the free drive\r\n\r\nGo stunt crazy in the open-world free-drive game mode. Rack up some cash doing epic stunts and speed around without limits in an open arena filled with ramps and other stunt-worthy objects.\r\n\r\nBuy and upgrade your supercar\r\n\r\nUse all that gold coinage you’ve earned as a reckless steering-wheel protagonist to expand your supercar collection. Tune up the engine and brakes, wear flashy new wheels, and treat yourself to a two-toned paint job. Night City Racing puts you in the driver’s seat.\r\n\r\nMore Games Like This\r\nCrazyGames has a vast selection of racing games and driving games, so once you’ve finished Night City Racing, check them out! A few popular right now include Moto X3M, a challenging motorcycle game featuring timed obstacle courses and stunts, and Drift Hunters, a car drifting game emphasizing realistic physics and customizable vehicles for high-speed drifting action.\r\n\r\nRelease Date\r\nJanuary 2023 (Android and WebGL)\r\n\r\nDeveloper\r\nNight City Racing was developed by RHM Interactive.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\nLast Updated\r\nNov 13, 2024\r\n\r\nControls\r\nIf playing one-player\r\n\r\nWASD \/ arrow keys = move\r\nR-Shift \/ L-Shift = NOS\r\nR = restart car position\r\nT = look back\r\nC = change camera view\r\nIf playing two-player\r\n\r\nPlayer 1\r\nArrow keys = move\r\nM = NOS\r\nO = restart car position\r\nL = look back\r\nK = change camera view\r\nPlayer 2\r\nWASD = move\r\nL-Shift = NOS\r\nR = restart car position\r\nT = look back\r\nC = change camera view\r\nFAQ\r\nHow many cars are there in Night City Racing?\r\nThere are 10 cars to drive. You already own two - the other 8 you can buy with in-game money.\r\n\r\nIs it worth completing the challenges in Night City Racing?\r\nYes, the challenges aren't too tricky and you earn good money for finishing them successfully.\r\n\r\nIs there a free racing game?\r\nThere are plenty of racing games to play online in your browser. Some popular games include Night City Racing.",
        "category": "racing",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/night-city-racing\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743315953990.jpg"
    },
    {
        "id": "demolition-derby-3",
        "title": "Demolition Derby 3",
        "description": "Demolition Derby 3 is a thrilling car game offering open-world driving and multiplayer modes. Choose from 100 vehicles, upgrade performance, and customize your ride. Enjoy 20+ tracks and demolition arenas, daily rewards, and first-person driving!\r\n\r\nRelease Date\r\nDecember 2018 (Android)\r\nFebruary 2019 (iOS)\r\nJuly 2024 (WebGL)\r\nPlatforms\r\nWeb browser\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 09, 2024\r\n\r\nControls\r\nWASD or arrow keys = drive\r\nShift = boost\r\nC = change camera\r\nQ\/E = rotate camera\r\nV = look back",
        "category": "racing",
        "rating": "4.4",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/demolition-derby-3\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316109842.jpg"
    },
    {
        "id": "doodle-road",
        "title": "Doodle Road",
        "description": "Doodle Road is an imaginative and captivating 2D casual game that combines creativity with problem-solving. In this fun browser game, your primary objective is to draw a path that will successfully guide a car from the starting point to the finish line. With a multitude of levels to explore, each one introduces new challenges and exciting obstacles that test your creativity and strategic thinking. Draw your way to victory and see how far your creativity can take you!\r\n\r\nHow to Play Doodle Road\r\nYou start in Doodle Road by practicing drawing a straight line from the car to the target. Sounds simple, right? Wait until you see how straight your line really is! The true challenge is how easy it is for your car actually to drive across that path.\r\n\r\nNext challenge – draw a line to the target, but now there's a wall in your way. Remember, your car can’t fly! So, think about how to draw your path – you don’t have to go over the wall; you can go under it! As you go, you'll see that drawing a straight line is harder than it looks. If you don’t start the line from behind your car, it’ll just dangle off into oblivion.\r\n\r\nHow do you get over an L-shape? Or a huge gap in the ground? And the challenges keep coming. By level 5, your engine shuts off, so you’ll need your physics brain to figure out how to use hills and momentum to get across.\r\n\r\nSome levels have trampoline-like springs that’ll launch you toward your target. The challenges change each time, keeping you on your toes. Buckle up because it's going to be a bumpy ride, depending on how well you draw!\r\n\r\nMore Games Like This\r\nThe fun has just begun! Browse our casual games, including Marble Run, a fun simulation game where you create your own marble run using a range of tools. Other casual games worth playing include World’s Hardest Game, a causal game that certainly lives up to its name all these years later, or Gold Miner, a classic casual mining game reminiscent of the early 2000s that has captivated players for years.\r\n\r\nRelease Date\r\nAugust 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nDec 23, 2024\r\n\r\nControls\r\nLeft mouse button to draw a line.\r\nRestart button or R to restart.\r\nStart button or Space to start.\r\nFAQ\r\nHow to play Doodle Road game?\r\nThe objective of Doodle Road is to draw the perfect path to guide your car from start to finish in an addictive and creative browser game!\r\n\r\nHow to play Doodle Road game with engines off?\r\nWhen you reach a level with your engine off in Doodle Road, you will need to use your physics-based logic as much as possible. Try to create velocity curves to propel your car as much as possible",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/doodle-road\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316223927.jpg"
    },
    {
        "id": "rally-racer-dirt",
        "title": "Rally Racer Dirt",
        "description": "Rally Racer Dirt is a rally drift-based game, allows you to drift on both asphalt and dirt terrains while navigating through hills. This category is redefined with the introduction of Rally Racer Dirt, offering the best realistic and stunning controls for a rally game. Enjoy the experience of drifty and realistic tuned physics, coupled with detailed graphics, various vehicles, and racing tracks. Be a rally racer, driving like Ken Blocks and Collin McRae on the tracks. The game features a Realtime Multiplayer Mode, 13 different rally cars, tunable cars with adjustable features, upgradable cars and drive properties, 5 different tuned tracks, and more. Choose between two main game modes: Challenge mode, with 60 different challenges to pass, and Survival mode, where you drift and drive as long as you can, passing checkpoints.\r\n\r\nRelease Date\r\nJanuary 2015 (Android)\r\nMarch 2015 (iOS)\r\nNovember 2023 (WebGL)\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nLast Updated\r\nMar 26, 2025\r\n\r\nControls\r\nWASD or arrow keys = vehicle control\r\nSpace or Q = handbrake\r\nC = change camera",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/rally-racer-dirt\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316340014.jpg"
    },
    {
        "id": "assault-bots",
        "title": "Assault Bots",
        "description": "We'd like to hear your feedback. Share your experience via this form to help us improve Assault Bots.\r\n\r\nAssault Bots (previously Bot Machines) is an excellent real-time multiplayer vehicle battle game made by Blayze Games. Choose from an array of weapons, jump into the battlefield, and obliterate your opponents. Blayze games also make Bullet Force, Plated Glory, and more highly popular games!\r\n\r\nRebrand\r\nThe game has been rebranded as Assault Bots since 21 December 2020.\r\n\r\nBot Battles\r\nThe vehicular combat in Assault Bots is immense fun. The simple mechanics leave considerable room for you to harness your strategic and aiming skills to blow up your enemies, which quickly becomes an addictive and enjoyable experience.\r\n\r\nTeam Deathmatch\r\nThe game mode now uses team deathmatch. Work together with your teammates to eliminate as many opponents as possible within the time limit!\r\n\r\nCapture the Flag (legacy mode)\r\nAs well as destroying the opposition, you must capture as many flags as possible, as this is the critical objective. You capture flags by keeping your vehicle within the capture range of the flag while defending your position against enemies. This is where you can implement your personal and team strategy to get a competitive edge over the other side!\r\n\r\nCustomize\r\nOne of the aspects of Assault Bots that keeps the gameplay fresh is the ability to switch up your arsenal of weaponry. In any game, you'll have two slots free to choose from an array of weapons, including a minigun, machine gun, RPG, grenade launcher, and more. Each weapon has its strengths and weaknesses.\r\n\r\nYou can also apply add-ons like health-regen and turbo, as well as customizing the body and movement of your vehicle to create your favorite Assault Bots for Battle.\r\n\r\nRelease Date\r\nJune 2020\r\n\r\nDeveloper\r\nBlayze Games is the developer of Assault Bots. They develop several popular online games like Forward Assault and those mentioned at the top of the description.\r\n\r\nPlatforms\r\nWeb browser\r\nAndroid\r\nLast Updated\r\nSep 18, 2024\r\n\r\nControls\r\nWASD or arrow keys = move\r\nLeft-click = aim and shoot\r\nRight-click = Zoom\r\n1 and 2 = switch weapons\r\nSpace = hand brake\r\nShift = turbo\r\nE = jump\r\nR = reload\r\nT = chat\r\nTab = view scoreboard\r\nEsc = pause",
        "category": "racing",
        "rating": "4.5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/bot-machines\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316518137.jpg"
    },
    {
        "id": "mr-racer",
        "title": "Mr. Racer",
        "description": "Mr Racer—Car Racing is a thrilling racing game in our driving category in which you zoom through busy streets in various locations. Drive at high speeds in a variety of stunning supercars, dodging traffic. Tackle a range of driving challenges and become the ultimate MR RACER.\r\n\r\nHow to Play Mr Racer\r\nStart your racing journey with speed into the action! In Mr. Racer, there are various game modes that offer an exciting driving experience in a range of flashy automobiles. Speed your way through 5 unique locations, progressing your career as a racing driver and earning EXP to level up.\r\n\r\nChallenge. Complete various challenges to progress through the game. In challenge mode, there are 100 different challenges to complete, keeping the game fresh and offering tricky new tasks. Most of the challenges are time-based. You earn back some time by fast overtaking other vehicles.\r\n\r\nRace. In race mode, you’ll compete against another racer to place first. There are no bonuses for fast overtakes, so focus on beating your opponent to successfully complete the mission.\r\n\r\nChase. When you unlock chase mode, you’ll enjoy an unlimited number of chases. Chase the opposition down and show them who the master racer is!\r\n\r\nBuy and upgrade new vehicles\r\n\r\nAs you progress through the game and explore the various game modes on offer, you’ll earn money to buy new vehicles. There are various cars, some of which are incredibly fast. These newer vehicles will help you beat your opponents in races more easily.\r\n\r\nYou can also upgrade your vehicles with new paint jobs, wheels, lights, and wheel stances.\r\n\r\nMore Games Like This\r\nAre you looking for more supercar action after completing Mr. Racer? Check out more of our driving games or car games. Some other popular driving games are Drift Hunters, which lets you master the art of drifting, and Moto X3M, offering adrenaline-pumping motorcycle stunts on challenging tracks\r\n\r\nFeatures\r\nVarious game modes to challenge your racing abilities\r\n15 supercars to unlock and take to the tracks\r\nStunning 3D graphics & realistic lighting\r\nSwitch your view to 3 different camera angles\r\n5 realistic locations: Farmland, City, Mountain Day, Mountain Night, and Snow\r\nEncouragement from Maria!\r\nRelease Date\r\nAugust 2020 (Android)\r\nDecember 2023 (WebGL)\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nDec 04, 2024\r\n\r\nControls\r\nW \/ up arrow key = accelerate\r\nA \/ left arrow key = steer left\r\nD \/ right arrow key = steer right\r\nS \/ down arrow key = brake\r\nH = horn\r\nFAQ\r\nHow many cars are there in Mr. Racer?\r\nThere are currently 15 cars ranging from supercars to SUVs.\r\n\r\nHow to honk in Mr Racer?\r\nYou can use the H key to honk in Mr Racer.\r\n\r\nCan I upgrade my car in Mr. Racer?\r\nYou can only buy cosmetic upgrades for your car.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mr-racer---car-racing\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316631415.jpg"
    },
    {
        "id": "room-escape-strange-case",
        "title": "Room Escape: Strange Case",
        "description": "Room Escape: Strange Case is a mystery puzzle game where you, the true detective, delve into the enigma of the elusive \"Alchemist.\" Unravel the chilling tale of defiled graves, navigating through a unique graphic style and atmospheric puzzles. Encounter strange characters and escape clever traps in your quest to unveil the Alchemist's identity. Are you up for the challenge of this original and mysterious adventure? You can also watch the walkthrough for chapter 1, chapter 2, and chapter 3.\r\n\r\nRelease Date\r\nSeptember 2019 (Android)\r\nDecember 2020 (iOS)\r\nNovember 2023 (WebGL)\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nFeb 17, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with objects.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/room-escape-strange-case\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316826103.jpg"
    },
    {
        "id": "game-911-prey",
        "title": "911: Prey",
        "description": "911: Prey is a scary horror game with puzzles. In this game, you are a kidnapped teenager that needs to escape from a cannibal maniac who brought you to his house. Search for any useful items to help you get out of his house. Be very careful and cover up your tracks so that the maniac does not suspect anything!\r\n\r\nFeatures\r\nMultiple endings - it all depends on your actions\r\nBranching detective story\r\nInteresting puzzles\r\nFascinating story and investigation\r\nHorror elements, hide and seek, and survival\r\nQuality sound and detailed environment\r\nRelease Date\r\nJuly 2023 (Android and iOS)\r\nAugust 2023 (WebGL)\r\nDeveloper\r\n911: Prey is made by Euphoria Games.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nNov 22, 2024\r\n\r\nControls\r\nPC\r\nWASD = move\r\nF \/ left-click = use item\r\n1-6 = select inventory item\r\nC = sit down \/ crouch\r\nH = hint\r\nP = pause\r\nMobile\r\nUse the joystick and buttons on the screen.\r\nCamera sensitivity can be changed in the settings.",
        "category": "horror",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/911-prey\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316911733.jpg"
    },
    {
        "id": "escape-room-strange-case-2",
        "title": "Escape Room: Strange Case 2",
        "description": "Escape Room: Strange Case 2 is an adventure-packed escape game that immerses you in a suspenseful journey through the dark and eerie corridors of a mysterious asylum. Unravel sinister secrets, solve intricate puzzles, uncover hidden clues, and unlock doors as you navigate through the haunting environment.\r\n\r\nFeatures\r\nComplex Puzzles: Decode cryptic clues and unlock challenging riddles to progress through each room.\r\nHaunting Atmosphere: Explore an asylum filled with eerie visuals and spine-chilling mysteries.\r\nImmersive Mystery: Piece together a gripping story filled with twists and surprises.\r\nOffline Gameplay: Enjoy the experience without needing an internet connection.\r\nNo Hidden Costs: Dive straight into the action without in-app purchases or subscriptions.\r\nWill you uncover the asylum’s secrets, make it to the final exit, or succumb to its dark allure? The challenge is yours to accept!\r\n\r\nLast Updated\r\nJan 21, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with objects.",
        "category": "horror",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/escape-room-strange-case-2\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743316981475.jpg"
    },
    {
        "id": "fnaf-shooter",
        "title": "FNaF Shooter",
        "description": "FNaF Shooter is a first-person shooter game where you survive and save the world from the invasion of animatronics!\r\n\r\nRelease Date\r\nFebruary 2022\r\n\r\nDeveloper\r\nGoGoMan made this game.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nControls\r\nMouse = look around\r\nWASD = movement\r\nW + Shift = run\r\nSpace = jump\r\nLeft mouse button = shoot\r\nRight mouse button (hold) = aim\r\nMouse wheel = next \/ previous weapon\r\n1-7 = weapon hotkeys\r\nR = reload\r\nG = throw a grenade",
        "category": "horror",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/fnaf-shooter\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317052356.jpg"
    },
    {
        "id": "monster-makeup-3d",
        "title": "Monster Makeup 3D",
        "description": "Monster Makeover is a creative game where you transform monsters into humans to help them blend into society. Use your skills to choose skin tones, eye lenses, teeth, and wigs, ensuring they stay hidden from angry mobs. Protect these creatures by mastering the art of disguise and helping them live peacefully among humans.\r\n\r\nFeatures\r\nExcellent 3D art style.\r\nFunny animations.\r\nHilarious Failure experience.\r\nSatisfying ASMR feel.\r\nGet a stunning response in the end.\r\nLast Updated\r\nJan 08, 2025\r\n\r\nControls\r\nUse the left mouse button to interact with the in-game UI.",
        "category": "horror",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/monster-makeup-3d\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317148066.jpg"
    },
    {
        "id": "horror-tale",
        "title": "Horror Tale",
        "description": "Horror Tale Kidnapper is a frightening first-person horror adventure game. Solve the disturbing mystery of the missing children at Lakewitch. Who is the kidnapper, and why are they doing it? Where are the children disappearing, and how can we save them? It's up to you to find out.\r\n\r\nHow to Play Horror Tale Kidnapper\r\nIn this episode, you meet your friend Harry, who plans to keep you and the other kids from your neighborhood safe from the kidnapper while you're waiting for your parents to return.\r\n\r\nTogether with him, you will fortify the tree house so the spooky kidnapper can't get you. On the way to your goal, puzzles, moments of fear, screams, unexpected twists and turns, and lots of fun await you!\r\n\r\nFeatures\r\nMysterious and fascinating story\r\nInteresting characters with a scary antagonist\r\nPuzzles and riddles to solve\r\n5 diverse locations to explore\r\nOriginal author's soundtrack\r\nRelease Date\r\nJuly 2022 (Android and iOS)\r\nJanuary 2023 (Steam)\r\nMarch 2023 (WebGL)\r\nDeveloper\r\nHorror Tale: Kidnapper is developed by Euphoria Games.\r\n\r\nPlatforms\r\nThis game is available in web browsers (desktop and mobile) and in Android, iOS, and Steam versions.\r\n\r\nMore Games Like This\r\nOnce you've finished Horror Tale Kidnapper, there are many more frights in our adventure games category. If you're itching for something less scary, check out World's Hardest Game, House of Hazards, or Dumb Ways to Die.\r\n\r\nLast Updated\r\nNov 21, 2024\r\n\r\nControls\r\nPC Controls\r\nWASD = movement\r\nF = action\r\nC = crouch (If you crouch, the noise will be less)\r\nH = hint menu\r\nX = leave the item\r\nG = throw an item\r\nP = pause, skip cutscenes\r\nMobile Controls\r\nJoysticks and buttons on the screen. Interface transparency and camera sensitivity can be changed in the settings.\r\nFAQ\r\nWhat is the name of the kidnapper in the horror tale?\r\nThe main villain of the Horror Tale Kidnapper game is known as Chase.\r\n\r\nWhat is the age rating for Horror Tale 1 kidnapper?\r\nAccording to the App Store, Horror Tale Kidnapper is a 12+.\r\n\r\nIs Horror Tale a good game?\r\nEuphoria Games' Horror Tale Kidnapper title is a game of thrilling moments and a solid afternoon of gameplay. If you are looking for true horror, this may not fit the bill, but it offers surprises to keep you on the edge of your seat.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/horror-tale-kidnapper\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317207148.jpg"
    },
    {
        "id": "game-911-cannibal",
        "title": "911: Cannibal",
        "description": "911: Cannibal is a spine-chilling horror game where you have to escape the house of a maniacal cannibal. Playing as a kidnapped teenager, your mission is to find items that help you escape by solving various puzzles, all while covering your tracks to avoid detection. Can you outsmart the cannibal and escape his clutches, or will you be his next victim? Explore the ominous house, uncover notes, and unravel the twisted story of Minnesota's most frightening maniac.\r\n\r\nOnce you've escaped the grip of an unhinged cannibal, why not get yourself into another terrifying situation in one of our many horror games. Check out Horror Tale and Exhibit of Sorrows for two other top-rated scary games.\r\n\r\nFeatures\r\nFascinating story and investigation\r\nInteresting puzzles to solve\r\nHorror elements, hide and seek, and survival\r\nDetailed environment to explore\r\nRelease Date\r\nJanuary 2023 (Android and iOS)\r\nMarch 2023 (WebGL)\r\nDeveloper\r\n911: Cannibal is developed by Euphoria Games.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nNov 22, 2024\r\n\r\nControls\r\nPC Control\r\nWASD = move\r\nF \/ left-click = interact\r\n1-5 = use inventory items\r\nC = crouch\r\nH = hint\r\nP = pause\r\nMobile Control\r\nUse in-game joysticks and buttons on the screen. Camera sensitivity can be changed in the settings.",
        "category": "horror",
        "rating": "4.9",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/911-cannibal\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317266122.jpg"
    },
    {
        "id": "diner-in-the-storm",
        "title": "Diner in the Storm",
        "description": "Diner in the Storm is a puzzle adventure game that plunges you into a heart-pounding escape adventure, where danger lurks not only outside but within the walls of a seemingly ordinary roadside diner. Caught in the grip of a sudden and ominous storm, you seek shelter in a roadside diner, only to find that safety is fleeting, and the diner harbors dark secrets. As the storm rages on, you must solve a series of intricate puzzles that push your logic, wit, and nerves to the limit. Each puzzle reveals new mysteries about the diner’s hidden past.\r\n\r\nHow to Play Diner in the Storm\r\nIn Diner in the Storm, every interaction brings you deeper into the mysterious world of this stormy night. As soon as you enter the diner, you're greeted by Maggie, the friendly yet wary waitress.\r\n\r\nMaggie: \"Come on in, sweetheart, and close the door behind you. This storm isn’t letting up anytime soon. Grab a seat—I’ll bring you a hot coffee and the menu.\"\r\n\r\nMaggie gestures towards the radio, giving you a subtle hint: \"Feel free to change the music if you want.\"\r\n\r\nAs you settle in, the game’s atmosphere intensifies. You begin to overhear snippets of a conversation from a nearby booth. Ethan, a jittery customer, is talking to Edith, though she doesn’t seem interested.\r\n\r\nEthan: \"Did you see anything weird in the sky on your way here?\"\r\n\r\nEdith: \"Ugh, here we go again…\"\r\n\r\nEthan, undeterred, leans in: \"I swear, we saw something huge—like flickering lights—just before the storm hit. Well... I saw it anyway.\"\r\n\r\nAt this point, you’re prompted to decide how to respond. Asking the right question might nudge Ethan to reveal something eerie, like: \"I’m telling you, it was aliens. No way that was just lightning!\"\r\n\r\nAs you explore further, another patron, Juan, catches your eye. His reaction is far from friendly.\r\n\r\nJuan: \"What are you looking at?\"\r\n\r\nHis aggressive tone suggests you should steer clear, and the game allows you to choose whether to confront him or simply move along. Either way, he doesn’t seem like someone who wants company.\r\n\r\nWandering through the diner, you spot a woman who seems familiar. She notices your glance and quickly cuts you off: \"No photos, no autographs.\"\r\n\r\nYou ask who she is, and the game reveals that she's none other than Bruna Starr, a social media sensation. \"Bruna Starr, three million followers. You seriously don’t know me?\"\r\n\r\nYou can respond, \"I’m not on the app. I listen to the radio instead.\"\r\n\r\nShe shrugs, her voice detached: \"Well, I travel a lot. Guess you could say I’m off the grid.\"\r\n\r\nAnother figure, Csapar, an older, mysterious man, sits alone at a booth. When you ask to join him, he nods quietly.\r\n\r\n\"I’m no ghost,\" he says with a knowing smile, \"but I’ve got stories that might make you believe otherwise.\"\r\n\r\nIn Diner in the Storm, these conversations aren't just filler—they lead you deeper into the puzzle-filled world, where every dialogue unlocks new clues about the diner, its patrons, and the strange forces at play outside. Your goal is to uncover the truth behind the storm—or become another unsolved mystery.\r\n\r\nThere are multiple scenarios that can take place, but your ultimate goal is to get everyone out of the diner and to safety in a town nearby named Hope Springs.\r\n\r\nMore Games Like This\r\nDiner in the Storm is a unique experience for puzzle game lovers! Browse popular titles like Mahjongg, Match the Color, The Impossible Quiz, Nonogram and more.\r\n\r\nRelease Date\r\nJanuary 2024\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nMar 14, 2024\r\n\r\nControls\r\nLeft mouse button to interact.\r\n(Optional) AD, left\/right arrow keys, and space to move left and right.\r\nFAQ\r\nWhat is the story of Diner in the Storm?\r\nDiner in the Storm takes you through a seemingly ordinary evening where your character is caught in a storm and stops at a nearby diner for shelter. You speak to all the patrons in a similar situation, and the story soon unfolds...\r\n\r\nHow do you get Maggie to comes with you in Diner in the Storm?\r\nMaggie will come with you only after you have spoken to Caspar about Maggie.\r\n\r\nWhen did Diner in the Storm come out?\r\nDiner in the Storm was released on January 5, 2024 by developer Maxim Tsai.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/diner-in-the-storm\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317315357.jpg"
    },
    {
        "id": "haunted-school",
        "title": "Haunted School",
        "description": "Haunted School is a horror survival game where you search a school for the tools required to exorcise a demonic child. Explore the map looking for clues and supplies. How long will you survive the Haunted School?\r\n\r\nSearch for answers\r\nRoam the corridors of this ravaged school in search of answers. Solve the puzzles and find the priest's tools so you can banish the demonic girl before it’s too late.\r\n\r\nSurvive the horrors\r\nEarly in the game, you’ll find a shotgun. You can use this to shoot the girl away before she kills you, but it will only rid you of her temporarily. If you run out of ammo, then all you can do is run and hope you don’t become demon food. The priest has left notes as clues throughout the Haunted School. Follow them for advice.\r\n\r\nPrepare for jump scares\r\nHaunted School gets progressively scarier and utilizes jump scares and tension to put you on the edge of your seat. The vibe is similar to other famous survival horror games like Silent Hill and Amnesia: The Dark Descent. Expect unforgiving frights.\r\n\r\nYou can find more games like this in the horror and scary categories.\r\n\r\nRelease Date\r\nApril 2022\r\n\r\nDeveloper\r\nHaunted School - Horror Game is made by Tonny Nevel.\r\n\r\nPlatforms\r\nWeb browser\r\n\r\nLast Updated\r\nMar 16, 2023\r\n\r\nControls\r\nWASD or arrow keys = movement\r\nE = pick-up item\r\nR = reload\r\nC = crouch\r\nLeft-click = sprint\r\nLMB = shoot\r\nG = drop item\r\n1 \/ 2 = change slot\r\nESC = pause",
        "category": "horror",
        "rating": "4.6",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/haunted-school---horror-game\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317376675.jpg"
    },
    {
        "id": "exhibit-of-sorrows",
        "title": "Exhibit of Sorrows",
        "description": "Exhibit of Sorrows is a short horror game set in a curious circus-themed exhibit. Explore this strange interactive museum, follow instructions, and don’t upset the clown!\r\n\r\nHow to Play\r\nNot all is well in the Exhibit of Sorrows. Move through this progressively creepy exhibition and check out the strange dolls on display. Interact with the dolls to reveal the keys. Be prepared to do terrible things to escape.\r\n\r\nThe mood get darker and more unsettling as you progress. You will encounter the same exhibitions in disturbing new forms as you become increasingly more panicked to escape. You will have to make cruel decisions in order to leave.\r\n\r\nRegardless of the sinister undertone to the game, there is a story to learn that will keep you gripped to the end. Exhibit of Sorrows is an excellent horror game worth seeing through.\r\n\r\nFeatures\r\nOriginal concept\r\n10-minute playtime\r\nUnsettling experience\r\nFree to play\r\nMore Scary Games\r\nBrowse our horror and scary categories for more strange, creepy, and terrifying games. Check out Horror Tale and FnAF Shooter next.\r\n\r\nRelease Date\r\nApril 2022\r\n\r\nDeveloper\r\nMaxim Tsai developed this game.\r\n\r\nPlatform\r\nWeb browser\r\n\r\nLast Updated\r\nDec 17, 2024\r\n\r\nControls\r\nUse the left mouse button to interact and collect the keys.\r\n\r\nFAQ\r\nWhere can I play Exhibit of Sorrows for free?\r\nYou can play it for free on CrazyGames.com\r\n\r\nHow many endings are there in Exhibit of Sorrows?\r\nThere is only one ending in this game.",
        "category": "horror",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/exhibit-of-sorrows\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317420879.jpg"
    },
    {
        "id": "scary-horror-escape-room",
        "title": "Scary Horror Escape Room",
        "description": "Scary Horror Escape Room is a creepy escape room game set in a mysterious place. Solve tricky puzzles and escape the place alive!\r\n\r\nRelease Date\r\nNovember 2019 (Android and iOS)\r\nOctober 2022 (WebGL)\r\nDeveloper\r\nArpaplus made this game.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 05, 2022\r\n\r\nControls\r\nUse the left mouse button to interact with the objects and follow the in-game tutorial.",
        "category": "horror",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/scary-horror-escape-room-games\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743317478830.jpg"
    }
]