[
    {
        "id": "traffic-rider",
        "title": "Traffic Rider",
        "description": "Traffic Rider is a first-person endless racing game that puts you on a motorbike for an exhilarating ride. With a full career mode, lifelike bike sounds, and detailed graphics, it redefines arcade racing. Speed through highways, overtake traffic, and upgrade your rides to conquer challenging missions. Embrace the thrill and master the art of smooth racing.\r\n\r\nFeatures\r\nFirst person camera view\r\n34 motorbikes to choose from\r\nReal motor sounds recorded from real bikes\r\nDetailed environments with day and night variations\r\nCareer mode with 90+ missions\r\nOnline leaderboards and 30+ achievements\r\nSupport for 19 languages\r\nLast Updated\r\nMar 27, 2025\r\n\r\nControls\r\nUp arrow = throttle\r\nDown arrow = brake\r\nLeft arrow = left\r\nRight arrow = right\r\nHorn = H\r\nWheelie = Y\r\nLook left = T\r\nLook right = U\r\nGear up = R\r\nGear down = F\r\nPause = P or F1\r\nYou can always change controls in settings menu.",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/traffic-rider-vvq\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743257697685.jpg"
    },
    {
        "id": "sky-riders",
        "title": "Sky Riders",
        "description": "Sky Riders is a high-speed casual vehicle driving game. Put your driving skills to the test as you complete several challenging tracks. Stay focused and avoid falling off! Whether you're behind the wheel of a car or riding a motorcycle, prepare for an adrenaline-fueled adventure and unforgettable racing moments. Get ready to conquer difficult tests and feel the excitement of Sky Riders!\r\n\r\nThis game is similar to other casual car games, but has a more realistic twist. For something more arcade-style, check out Super Hero Driving School and Ramp Car Jumping!\r\n\r\nFeatures\r\nDrive bikes and cars through the sky\r\n30 challenging tracks to complete\r\nRealistic physics make the game tricky\r\nSee what awesome stunts you can do!\r\nRelease Date\r\nJune 2023\r\n\r\nDeveloper\r\nSky Riders was developed by Stand By Games.\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\nAndroid\r\nLast Updated\r\nDec 21, 2023\r\n\r\nControls\r\nW or up arrow key = forward\r\nS or down arrow key = back\r\nA or left arrow key = move left\r\nD or right arrow key = move right\r\nSpace = handbrake\r\nLeft mouse button = interact ingame UI",
        "category": "racing",
        "rating": "5",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/sky-riders-buk\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743260555299.jpg"
    },
    {
        "id": "mahjongg-solitaire",
        "title": "Mahjongg Solitaire",
        "description": "Mahjongg Solitaire is an online mahjong puzzle board game featuring traditional rules and modern visuals. There are no shuffles, and the game is timed, but the game's pace is relaxed.\r\n\r\nHow to Play Mahjongg Solitaire\r\nSpot the patterns\r\n\r\nMahjong is a tricky puzzle game. There are so many tiles, many of which look the same but feature slight differences. Along with the need to spot these patterns, you can’t move any pieces with both sides blocked. The left or right side needs to be accessible, at least.\r\n\r\nUse hints when you’re stuck\r\n\r\nMahjongg Solitaire features hints if you get stuck, but unlike some other mahjong games, it does not have a shuffle feature. The games are also timed, meaning there is some urgency to how many tiles you can match.\r\n\r\nWhen the game ends, you’ll get a score for the tiles you matched and a bonus for how far you got in the game before your time ran out.\r\n\r\nTile groups in Mahjongg Solitaire\r\nMahjongg Solitaire features 144 tiles divided primarily into three suits. The primary suits are:\r\n\r\nDots - feature circles\r\nBamboo - feature lines\r\nCharacters - feature Chinese characters\r\nIn Mahjongg Solitaire, you’ll also notice special tiles that can be matched even without the same image. These are highlighted in blue or green.\r\n\r\nMore Games Like This\r\nMahjong Solitaire is an excellent choice for a beginner or regular Mahjong enthusiast. However, there are many other titles in our collection of Mahjong games such as Mahjong. Other puzzle games you may like include board games such as Yahtzee Online, Rummikub, and Ludo.\r\n\r\nRelease Date\r\nOctober 2016\r\n\r\nPlatform\r\nWeb browser (desktop and mobile). We also have the Android version.\r\n\r\nLast Updated\r\nAug 03, 2022\r\n\r\nControls\r\nUse the left mouse button to interact.\r\n\r\nFAQ\r\nIs it spelled mahjong or mahjongg?\r\nBoth words are correct and are used to describe the same game.\r\nIs Mahjongg Solitaire a difficult game?\r\nMahjong is generally a tricky game, but this is probably a medium-difficulty mahjong game compared with others. There are no shuffles, but you have 10 minutes and unlimited hints which balances the game nicely.\r\nIs Mahjong Solitaire a free game?\r\nYes, you can play Mahjong Solitaire online for free at CrazyGames.\r\n\r\nIs Mahjong good for the brain?\r\nPuzzle games are often cited as keeping the mind sharp and maintaining brain health.",
        "category": "puzzle",
        "rating": "4.8",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/mahjongg-solitaire\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743264862795.jpg"
    },
    {
        "id": "farm-merge-valley",
        "title": "Farm Merge Valley",
        "description": "Farm Merge Valley is a puzzle business farming game where you merge various animals and objects to upgrade them. Grow crops and add animals to your farm while expanding to exciting new lands. Discover the peaceful farm life you always dreamed of while reaping the rewards from various challenges.\r\n\r\nHow to Play Farm Merge Valley\r\nMerge to grow your farm\r\n\r\nBuild the perfect farm life for your friendly neighbors and animals. Start by merging crops to reach new types of things to grow. You can create various animals, crops, and materials to produce goods and repair buildings.\r\n\r\nLevel up your experience\r\n\r\nKeep merging to gain experience points and increase your level. You will unlock new items and rewards that help you progress in the game when you level up. Leveling up brings more game features to enjoy and areas that help expand your farm.\r\n\r\nFulfil orders to earn money\r\n\r\nWhen your animals produce output, you can use the product to manufacture goods to sell for money. You can use your currency to purchase new areas of land and grow your farm to new heights. You'll find new buildings to renovate and expand your production to new heights that deliver greater monetary rewards.\r\n\r\nMore Games Like This\r\nYou might want to play something new when you've finished Farm Merge Valley. Browse our merge games for more free and fun gaming experiences. Little Alchemy and Little Alchemy 2 are worth a try. Other puzzle games you may enjoy are Bolts and Nuts and Sand Tetris. You may also want to have a look at our wide range of farming games.\r\n\r\nFeatures\r\nMerge crops and animals to create more valuable items\r\nComplete various tasks and reap the rewards from your labor\r\nExpand to new lands as you progress\r\nBuild a beautiful self-sustaining farm life\r\nRelease Date\r\nNovember 2022\r\n\r\nPlatform\r\nWeb browser (desktop and mobile)\r\n\r\nLast Updated\r\nMar 17, 2025\r\n\r\nControls\r\nPress and hold the left mouse button to pick up and move objects on the grid.\r\n\r\nFAQ\r\nHow can I make money more quickly in Farm Merge Valley?\r\nThe best way is to save your coins so you can merge them. Try to reach the golden star coin to get a big payout.\r\n\r\nWhat are the toolboxes for in Farm Merge Valley?\r\nThey provide one component required to renovate a new area of production.\r\n\r\nHow do you play Farm Merge?\r\nFarm Merge tasks you with creating the perfect farm life for your friendly neighbors and animals. Merge crops to create a bustling farm of animals, materials and plenty of food!",
        "category": "puzzle",
        "rating": "4.4",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/farm-merge-valley\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743265320769.jpg"
    },
    {
        "id": "words-of-wonders",
        "title": "Words of Wonders",
        "description": "Words of Wonders is a crossword puzzle where you connect letters to reveal hidden words. Test your vocabulary and find all the words to progress and reach more challenging levels. Will you become a master wordsmith in this delightful word game?\r\n\r\nHow to Play Words of Wonders\r\nWords of Wonders is an engaging word puzzle game that combines the excitement of crossword puzzles with the thrill of word search. Players form words by connecting letters in a grid, unlocking hidden words,, and progressing through levels.\r\n\r\nYou'll see a grid of random letters when you start the game. Each grid represents a level; your task is to find words by connecting adjacent letters. You can swipe your finger over the letters in any direction—horizontally, vertically, or diagonally—to form words. Longer words and more complex combinations may unlock bonus rewards, so watch for opportunities to maximize your word choices.\r\n\r\nConnect the letters to form a word. It will be revealed if the word you formed is on the crossword grid. Not all words will be on the grid, so use the letters you have already discovered to ensure you create words that will fit the puzzle!\r\n\r\nCompleting the grid allows you to unlock the next level, which gets progressively more challenging. The difficulty increases with more letters and words to find, so keep your brain engaged as you move through the game.\r\n\r\nSome examples include finding the words “WON,” “OWN,” “NOW,” or “TOP,” “POT,” or “OPT” from a set of three letters. Or a mixture of three and four-letter words to form “WALL,” \"ALL,” and “LAW.”\r\n\r\nIf you find yourself stuck, there are hints and boosters available to help you out. These tools can reveal letters or help you find the next word, though they're limited, so use them wisely. There are also rewards for completing levels or discovering difficult words, such as coins or additional hints, which can help you advance further.\r\n\r\nProgress through the levels and collect unique background images with each new milestone. The levels get more difficult by introducing longer words and more letters, increasing the chances of getting it wrong and challenging your vocabulary skills!\r\n\r\nSome levels feature specific themes, like landmarks or animals, where the words you form are related to that theme. As you progress, you’ll unlock different \"worlds\" or locations, each with unique challenges and puzzles. You also get fun bits of info throughout, like learning that The Great Pyramid of Giza is the oldest of the Seven Wonders of the Ancient World.\r\n\r\nThe goal is to find all the words in the grid before you run out of moves or time. Each level has a set number of words to complete in order to progress to the next stage. You may also encounter bonus rounds or challenges that offer extra rewards when completed.\r\n\r\nAs you move through levels, you'll earn points, coins, and other rewards, which will help you advance in the game. Some versions of the game also let you compete against friends or other players, adding a competitive element to the experience.\r\n\r\nWith its relaxing pace and engaging gameplay, Words of Wonders is a fun way to challenge your mind and expand your vocabulary while enjoying an immersive puzzle-solving experience.\r\n\r\nEnjoy a range of exciting and challenging word puzzles in Words of Wonders. The game features an easy starting point to suit players of all ages and experience levels. See how good you are at finding all the words and become a master wordsmith!\r\n\r\nGame Tips\r\n\r\nUse the letters you have already discovered as a clue to find the word\r\nUse the hammer icon to reveal a letter of your choice\r\nClick on the hints button to reveal a random letter\r\nEarn gems to buy hints and reveal letters\r\nMore Games Like This\r\nOnce you’ve reached your linguistic limits in Words of Wonders, check out more of our curated word games. There are many fun word games for all knowledge levels. Two popular choices to play next are Word Wipe, a word search game with a twist where you use letters from all around and in any direction; Word Scramble, a classic word game where you unscramble letters to find words, or Word Search, a simple yet classic game offered in different languages.\r\n\r\nRelease Date\r\nApril 2018 (Android and iOS)\r\nMay 2023 (HTML5)\r\nDeveloper\r\nWords of Wonders was made by Famobi.\r\n\r\nPlatforms\r\nWeb browser (desktop and mobile)\r\nAndroid\r\niOS\r\nLast Updated\r\nOct 19, 2023\r\n\r\nControls\r\nDrag the left mouse button on the letters to assemble a word.\r\n\r\nFAQ\r\nHow do you earn sapphires in Words of Wonders?\r\nYou can earn gems by completing levels and taking part in the daily spin to win.\r\n\r\nIs Words of Wonders a difficult game?\r\nIt's not too tricky to play, but gets harder as the levels progress. It's an excellent game for all ages.",
        "category": "puzzle",
        "rating": "4.7",
        "iframe": "<iframe src=\"https:\/\/www.crazygames.com\/embed\/words-of-wonders\" style=\"width: 100%; height: 100%;\" frameborder=\"0\" allow=\"gamepad *;\"><\/iframe>",
        "thumbnail": "1743266067856.jpg"
    }
]